{
  "fetch_timestamp": "2025-10-14T11:30:28.570279",
  "total_unique_posts": 83,
  "subreddits_checked": 8,
  "subreddit_stats": {
    "Earnin": {
      "info": {
        "name": "Earnin",
        "title": "EarnIn",
        "subscribers": 21085,
        "description": "Earnin"
      },
      "new_posts_count": 0,
      "posts": []
    },
    "EarninB4B": {
      "info": {
        "name": "EarninB4B",
        "title": "EarninB4B",
        "subscribers": 2838,
        "description": "No description"
      },
      "new_posts_count": 1,
      "posts": [
        {
          "id": "1o5h6kg",
          "title": "B4B please",
          "content": "Hey! Quick favor - could you help me boost my cash out limit on EarnIn?\nI use it to access my earnings daily instead of waiting for payday. Thanks! https://boost.earnin.link/p95R9Z",
          "author": "_bxxnji_",
          "subreddit": "EarninB4B",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-13T17:02:10",
          "url": "https://www.reddit.com/r/EarninB4B/comments/1o5h6kg/b4b_please/",
          "permalink": "https://reddit.com/r/EarninB4B/comments/1o5h6kg/b4b_please/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.EarninB4B"
        }
      ]
    },
    "EarninBoost": {
      "info": {
        "name": "EarninBoost",
        "title": "EarninBoost",
        "subscribers": 762,
        "description": "No description"
      },
      "new_posts_count": 0,
      "posts": []
    },
    "cashadvanceapps": {
      "info": {
        "name": "cashadvanceapps",
        "title": "cashadvanceapps",
        "subscribers": 6671,
        "description": "No description"
      },
      "new_posts_count": 3,
      "posts": [
        {
          "id": "1o67253",
          "title": "Lock in with me fa da best Darkweb sites and forums on da market im showing everyone everything",
          "content": "",
          "author": "IndependentGoose8282",
          "subreddit": "cashadvanceapps",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 0,
          "created_utc": "2025-10-14T10:57:46",
          "url": "https://www.reddit.com/gallery/1o67253",
          "permalink": "https://reddit.com/r/cashadvanceapps/comments/1o67253/lock_in_with_me_fa_da_best_darkweb_sites_and/",
          "is_self": false,
          "over_18": false,
          "flair": null,
          "domain": "reddit.com"
        },
        {
          "id": "1o61vx7",
          "title": "Revoke Ualett",
          "content": "Does anyone have experience with this? ",
          "author": "catrovert13",
          "subreddit": "cashadvanceapps",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 1,
          "created_utc": "2025-10-14T06:36:20",
          "url": "https://www.reddit.com/r/cashadvanceapps/comments/1o61vx7/revoke_ualett/",
          "permalink": "https://reddit.com/r/cashadvanceapps/comments/1o61vx7/revoke_ualett/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.cashadvanceapps"
        },
        {
          "id": "1o5yk14",
          "title": "Revoke Tilt?",
          "content": "Has anyone ever revoked ACH with Tilt? I'm in the process of changing jobs and my paydays will be wonky & they'll cut my advance down, and I can't afford to pay them back the full thing right now. They'd cute it from $150 to $25 last week, but I waited until today and they bumped it back up to $150. \n\nHas anyone successfully revoked with Tilt? Or are they like Dave and won't let you? ",
          "author": "JellyfishAccurate429",
          "subreddit": "cashadvanceapps",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 7,
          "created_utc": "2025-10-14T04:06:57",
          "url": "https://www.reddit.com/r/cashadvanceapps/comments/1o5yk14/revoke_tilt/",
          "permalink": "https://reddit.com/r/cashadvanceapps/comments/1o5yk14/revoke_tilt/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.cashadvanceapps"
        }
      ]
    },
    "personalfinance": {
      "info": {
        "name": "personalfinance",
        "title": "Personal Finance",
        "subscribers": 21422858,
        "description": "**Featured posts**\n\n* [Scam alert: Ignore any private messages or chat requests. Private communication is not safe on Reddit.](https://www.reddit.com/r/personalfinance/comments/div0yy/ignore_any_priva"
      },
      "new_posts_count": 50,
      "posts": [
        {
          "id": "1o67812",
          "title": "Best banks for high yield saving accounts",
          "content": "Hey all, \n\nI'm looking for a bank that offers a savings account with minimal requirements and a competitive interest rate. What banks offer the best savings account interest yields that also don't come with a lot of catches and conditions? \n\nI am not very financially savvy, so any guidance will be greatly appreciated. \n\nThanks in advance. ",
          "author": "Super_Eye_5962",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 0.67,
          "num_comments": 2,
          "created_utc": "2025-10-14T11:07:36",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o67812/best_banks_for_high_yield_saving_accounts/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o67812/best_banks_for_high_yield_saving_accounts/",
          "is_self": true,
          "over_18": false,
          "flair": "Saving",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o674io",
          "title": "Rebuilding Credit and Saving for Down Payment for a Car",
          "content": "Hello to whoever is reading this. I wish I can add more flairs to this post. But anyways, I am trying to rebuild my life after losing pretty much everything. For me, I want to start off with rebuilding my credit score. My current score is a 550 according to Experian. Here are the following things that are on my credit report:\n\nCollection Accounts\n- Portfolio Recovery Associates: $1589. Defaulted on a credit card due to forgetting to changing payment methods.\n- Procollect Inc: $2599. Eviction due to unpaid rent, and fees that might have came up.\n\nLoans\n- Affirm: $215. I actually don’t remember what exact purchase this came from, and currently looking more into it.\n- Student loans because financial aid was not the best in my first and fourth year. (I’m still in college btw)\n\nCredit Cards\n- High Credit Utilization: I have a max credit amount of $1300 across 3 credit cards. The percentage was 109% due to my paycheck not aligning up and shit happening. I just paid off the full balance of one, so it should go down soon-ish, hopefully. \n\nMy end goal is to hopefully get enough to get an auto loan without a co-signer. What should I tackle on first, the debt collectors or the credit card balances? And, what are some other tips and ways to save to get to this far fetched goal.",
          "author": "SoWhoIsTitan",
          "subreddit": "personalfinance",
          "score": 2,
          "upvote_ratio": 1.0,
          "num_comments": 3,
          "created_utc": "2025-10-14T11:01:40",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o674io/rebuilding_credit_and_saving_for_down_payment_for/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o674io/rebuilding_credit_and_saving_for_down_payment_for/",
          "is_self": true,
          "over_18": false,
          "flair": "Credit",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o66z1v",
          "title": "Is it unwise to invest heavily  before I buy a house?",
          "content": "I have a chance to invest a good chunk of down payment that I have saved up into a different business venture. I feel good about this venture, but of course there are risks. Trying to gauge if it’s dumb to make a big investment before you have even purchased a house, or if it’s better to wait till you have a house and then use excess to invest? ",
          "author": "Phantasmadam",
          "subreddit": "personalfinance",
          "score": 2,
          "upvote_ratio": 0.75,
          "num_comments": 8,
          "created_utc": "2025-10-14T10:52:41",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o66z1v/is_it_unwise_to_invest_heavily_before_i_buy_a/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o66z1v/is_it_unwise_to_invest_heavily_before_i_buy_a/",
          "is_self": true,
          "over_18": false,
          "flair": "Planning",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o66qh8",
          "title": "Credit Building Situation",
          "content": "I currently have a credit score of 656 which is not terrible, but it used to be around 710 but i unfortunately had to basically blow my limit in an emergency room during an unpaid 2 month internship where i was making no money whatsoever at the time and couldn’t afford basically anything let alone a hospital trip. My current balance is 750 dollars which i will be fully paying off this week. How long do you think it would take to get my credit back above 700? I only have 1 Capital One Platinum card and I am 20 years old with 100% payment history but it is only 8 months old but the 97% credit utilization is what i think is hurting the most. i’m pretty un knowledgeable with credit so any help and advice ill take. ",
          "author": "Material-Dig-897",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 4,
          "created_utc": "2025-10-14T10:39:06",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o66qh8/credit_building_situation/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o66qh8/credit_building_situation/",
          "is_self": true,
          "over_18": false,
          "flair": "Credit",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o66jma",
          "title": "Help moving from high fee managed Stifel account (bonds) to self managed brokerage",
          "content": "I have a friend that has large amount at Stifel where it's actively managed for about 20 years now.  They bought California municipal bonds because they're tax exempt, they were also told to buy Puerto Rico muni bonds as well, unfortunately it defaulted.\n\n  \nMy concern is the high fees (not to mention commission, and account \"wrap fees\").  I want them to instead buy Vanguard's VTEC ETF (California tax except muni bond ETF) with much lower fees.  But I'm unsure how they can proceed?  My friend also thinks it's a good idea to move to a lower fee as well, but is also unsure.  They think they should wait until each bond is called, and gradually transfer that money to a brokerage like Schwab or Fidelity and then they can manage itself and buy VTEC on their own.\n\nI don't think that's a good idea to prolong the process, and instead move the entire account over... but not sure how that works since it's muni bonds.  With stocks I know they can do an ACATS transfer I believe where the entire account and stocks that are held are transferred to the new brokerage.\n\nI would love to some help and guidance please. \n\n  \nThanks",
          "author": "Main-Pomelo-9976",
          "subreddit": "personalfinance",
          "score": 2,
          "upvote_ratio": 1.0,
          "num_comments": 1,
          "created_utc": "2025-10-14T10:28:08",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o66jma/help_moving_from_high_fee_managed_stifel_account/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o66jma/help_moving_from_high_fee_managed_stifel_account/",
          "is_self": true,
          "over_18": false,
          "flair": "Investing",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o66bqe",
          "title": "Chime Refuses to Refund Fraudulent Transaction on Stolen Card",
          "content": "My wife’s wallet was stolen after a break-in. We filed a police report within a few hours and called all of our card issuers. Everyone else refunded the fraudulent transactions - except for Chime.\n\nDespite providing the information about the police report and filing an appeal, Chime says that \"we have concluded no error occurred. Therefore, no funds will be credited to your account and this claim is considered closed.\"\n\nWe requested the documents supporting the decision and got nothing. We plan to file complaints with the BBB and CFPB. Any other ideas? \n\n",
          "author": "timothywilliams2017",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.4,
          "num_comments": 7,
          "created_utc": "2025-10-14T10:15:46",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o66bqe/chime_refuses_to_refund_fraudulent_transaction_on/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o66bqe/chime_refuses_to_refund_fraudulent_transaction_on/",
          "is_self": true,
          "over_18": false,
          "flair": "Credit",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o66auw",
          "title": "Should I sell RSUs now or hold for long-term growth?",
          "content": "Hey everyone,\nI’m looking for some perspective on whether it makes sense to sell my vested RSUs now or hold onto them because I believe in the company’s long-term growth.\n\nHere’s my situation:\n\nCash & Assets\n- Checking: $16,000\n- Investing account: $2,000\n- RSUs:\n* 3,518 shares($36,000 net if sold at current stock price & trading windows opens in couple weeks)\n* 15,034 shares unvested, full vested in 09/01/2029\n\t\n\nDebt\n- Personal loan: $29,855 ($571/mo) \n- Credit card 1: $2,326\n- Credit card 2: $6,953\n\nIncome & Bills\n- Take-home: $4,500/month\n- Expenses: $3,500/month (personal loan included in this)\n\nI already am planning to full pay both credit at End of month. Just need advice on the RSU part and the idea of the long term potential gain or being debt free in couple weeks",
          "author": "iggywxng",
          "subreddit": "personalfinance",
          "score": 2,
          "upvote_ratio": 1.0,
          "num_comments": 6,
          "created_utc": "2025-10-14T10:14:29",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o66auw/should_i_sell_rsus_now_or_hold_for_longterm_growth/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o66auw/should_i_sell_rsus_now_or_hold_for_longterm_growth/",
          "is_self": true,
          "over_18": false,
          "flair": "Debt",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o6613t",
          "title": "649 Starting credit score?",
          "content": "Today i downloaded credit karma and saw my credit score was 649, Im confused i thought it started at 0, additionally my credit involvement was a month ago because i just started my first year of college, but I haven’t paid much on it.",
          "author": "GetAChris",
          "subreddit": "personalfinance",
          "score": 3,
          "upvote_ratio": 1.0,
          "num_comments": 4,
          "created_utc": "2025-10-14T09:59:38",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o6613t/649_starting_credit_score/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o6613t/649_starting_credit_score/",
          "is_self": true,
          "over_18": false,
          "flair": "Credit",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o65zvu",
          "title": "Car Loan Paid Off but Credit Union Won’t Release Title",
          "content": "This is for a friend so I may not have all the details. \n\nHe purchased a car in summer of 2020. Recently he made the final payment on the loan by going to the credit union, asking the remaining balance, and paying it off in cash. They said the title would be mailed out soon after. Some weeks went by and he called the credit union to ask about the status of his title. That was when he was informed that because he had an outstanding personal loan with the credit union that was delinquent, they would not give him the title. So he and I are both confused on how to proceed. He owes the credit union about $13k and cannot afford payments right now due to medical bills and not having a great job. Is the car at risk of repossession? I don’t think it’s in collections (yet) so can he negotiate with the credit union a way to get his title? I guess I’m just wondering what the best course of action is next. ",
          "author": "armhole3162",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 3,
          "created_utc": "2025-10-14T09:57:48",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o65zvu/car_loan_paid_off_but_credit_union_wont_release/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o65zvu/car_loan_paid_off_but_credit_union_wont_release/",
          "is_self": true,
          "over_18": false,
          "flair": "Debt",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o65yc5",
          "title": "I Need to Know if my Dad Stole from Me",
          "content": "Hello! My apologies if I put this in the wrong place on reddit, I'm new to making posts.\n\nI am a married 21 year old woman and can't believe I am genuinely asking this.\nLet me back up\n\nAt 13 I had whats called a Bat Mitzvah where I was given 2,100 dollars. My parents(rightfully) held onto it. For while it was in my savings account that I had no access to but it exsisted. At around 16 my dad asks if I'd like to put it in stocks(I have no clue what kind of account it was, just that it was not an account I ever had access too). I said yes since I knew he was good with money(this is just a fact). I was told this money would be taken out to get a car after college.\n\nFlash forward to before getting married(20 years old), I am low contact with my parents for a lot reasons that I won't delve into in this post. I ask my dad to give the money. He had at this point been putting in 250 dollars a month and turned my 2,100 dollars into almost 9,000. He told me that he since has removed it from stocks to ensure that the money would be mine rather than the governments. Okay fine. He then told me that rather than taking it now I could keep it in stocks and turn it into down-payment of a house instead of just getting a car.\n\nHe then told me to make a new account and sent over some documents stating essentially that he would have full control of the money. I am very glad I did not make an account or sign any of this. I could tell this annoyed him, with him even saying my brother now had more money than me. His was in stocks and mine was in a savings account(which I once again, have no access to).\n\nNow to today, I am faced with a crushing realization that the only kinda of accounts that would exsist for minors, would in fact transfers the funds over to said minor when they came of age not get stuck in limbo like I was led to believe.\n\nI have no clue what do or even what kind of account would've allowed him to take things out of stocks. Maybe i was lied to about it being a junior account but that doesn't make sense why he would take it out of stocks?\n\nProbably relavent to mention all this happened on an E-Trades account and I have proof the money is in a savings account.\n\nAnyone have any idea of how this happened?\nI really don't want to talk to either parent though I'm sure I'll have to but I wondered what exactly should be done here. Thanks!",
          "author": "ElshineW",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 5,
          "created_utc": "2025-10-14T09:55:31",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o65yc5/i_need_to_know_if_my_dad_stole_from_me/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o65yc5/i_need_to_know_if_my_dad_stole_from_me/",
          "is_self": true,
          "over_18": false,
          "flair": "Investing",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o654e5",
          "title": "How much should I budget for a house? First real doctor job.",
          "content": "Long story short is I have been training for around 19 years to become a  transplant surgeon, and just got my first job offer. It’s in my wife’s dream location in a mid sized city in the south. We have one child and hope to have a few more. She is also a physician. \n\nMy offer is a three year contract 360k base with a 35k signing bonus, and 10m relocation stipend. Each year the base goes up 20k, and there’s a 25k “quality” bonus for vague but achievable things (signing notes and orders on time etc). \n\nMy wife has a full time gig and makes 210k now but she will go part time and will make 140-160k. \n\nSo our total gross take home for the next three years is roughly 550k/year. \n\n\nMy wife has her heart somewhat set on a 1.2m dollar home. With 6.25 interest I was quoted and taxes/insurance etc I think this is about 8k a month from a 25k monthly budget. \n\n\nThis is a big change for us financially and I just want to make sure we are being responsible. I thought my offer would be a little higher like 450 so I’m somewhat disappointed but I like the other aspects of the job - the quality of life and the support are really great. \n\nIs this financially advisable? Should we get a cheaper house? My wife and I both sort of took a pause and were like. Hmm. Should we worry about the house finance this much? Wouldn’t it be easier in our minds to go with a lower monthly payment?\n\n\nAny advice would be great. But specifically - are we being irresponsible ??\n\nThanks!",
          "author": "transplant_beans",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.45,
          "num_comments": 50,
          "created_utc": "2025-10-14T09:11:54",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o654e5/how_much_should_i_budget_for_a_house_first_real/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o654e5/how_much_should_i_budget_for_a_house_first_real/",
          "is_self": true,
          "over_18": false,
          "flair": "Budgeting",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o651zr",
          "title": "I got scammed but couldn't cancel the transaction because it wasn't \"working hours\"",
          "content": "I was working with what I thought was a customer service representative for a legitimate compensation when I realized I had been duped and instead of getting the compensation I was defrauded out of $3,500. It was the weekend and I immediately tried to let my credit union know as well as the transfer app but got messages from  both that I had to get back during working hours. Had I been able to get help, the pending charge could have been cancelled instead of going through. Helpful thoughts and suggestions?",
          "author": "Useful_Condition863",
          "subreddit": "personalfinance",
          "score": 10,
          "upvote_ratio": 0.66,
          "num_comments": 7,
          "created_utc": "2025-10-14T09:08:42",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o651zr/i_got_scammed_but_couldnt_cancel_the_transaction/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o651zr/i_got_scammed_but_couldnt_cancel_the_transaction/",
          "is_self": true,
          "over_18": false,
          "flair": "Other",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o651mv",
          "title": "Need Advice: Chapter 7 Bankruptcy vs. Credit Card Charge-Offs & Payment Plans (High Income Drop)",
          "content": "Hi everyone,\nI'm looking for solid advice regarding my next financial move. My biggest concern is whether I should proceed with filing Chapter 7 bankruptcy to eliminate my unsecured debt, or if pursuing charge-offs and negotiating payment arrangements is the better path. I have a consultation with a lawyer this Thursday, but I would appreciate any community insights beforehand.\n\nMy Current Financial Snapshot:\n\n• Primary Goal: Eliminate credit card debt to free up funds to start paying down my student loans.\n\n• Current Debt:\n\n• Unsecured Debt: Over $20,000 in credit card debt across 8 lines.\n\n• Student Loans: Approximately $45,000 (non-dischargeable).\n\n• Car Loan: Current on all payments; I intend to keep the car. (2,300 left)\n\n• Assets/Savings: I have virtually no assets remaining (I sold them to cover rent) and no savings at the moment. My case would likely be a \"no-asset\" Chapter 7.\n\nIncome History & Payment Crisis:\n\nMy ability to pay changed significantly this year:\n\n1. Old Job: Laid off from an $80,000/year job in January 2025.\n\n2. Unemployment: Spent six months on unemployment, making about 1/4 of my previous pay. During this time, I stopped making credit card payments to prioritize rent and the car payment.\n\n3. Current Job: Started a new full-time job in August 2025, but my pay is now roughly half of my old $80k salary (i.e., ~$40k/year).\nThe Core Question:\n\nGiven my extreme drop in income (which is favorable for the Chapter 7 Means Test) and the complete lack of savings or non-exempt assets, what is the community's best recommendation?… I’m applying to higher positions. I have a bachelors and 10+ event management and coordination experience. \n\n1. File Chapter 7: Wipe out the $20k+ in credit card debt quickly, achieve the \"fresh start,\" and immediately focus all funds on rebuilding savings and attacking \nthe student loans.\n\n2. Wait for Charge-Offs & Negotiate: Let the accounts charge off, face collections, and then try to negotiate settlement/payment plans with creditors.\n\nAny advice on navigating this choice is greatly appreciated. Thank you.",
          "author": "Solid_Secretary_7090",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.33,
          "num_comments": 1,
          "created_utc": "2025-10-14T09:08:14",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o651mv/need_advice_chapter_7_bankruptcy_vs_credit_card/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o651mv/need_advice_chapter_7_bankruptcy_vs_credit_card/",
          "is_self": true,
          "over_18": false,
          "flair": "Credit",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o64mq5",
          "title": "35 YO Working Professional - Where do I go from here?",
          "content": "Hello. I currently work in healthcare and live on the West Coast. Currently mid-30s and looking for long-term planning/advice. \n\nIncome: $350k/yr\n\nTotal Loan Burden: \\~380K - plan on PSLF with monthly payments at about 1500/mo right now (to get up to 120 payments for forgiveness). Currently about half-way through. \n\nMonthly expenses are minimal - total of about 4K. (Live alone, apartment, no significant expenses at this time)\n\nTotal in various Investment Portfolios (retirement account, individual brokerage account, other accounts): \n\n1. Brokerage: Primarily index funds with a mixture of healthcare, goods, banking, energy, technology, pharmaceuticals. \\~$200,000\n2. Retirement: All SP500 Index Funds. \\~$180,000. I max out all relevant employee retirement plans (403b via pre-tax contributions and a 457. Contributions are maxed out every year). \n\nSavings: \\~$45,000\n\nChecking: \\~$90,000\n\nI spend on myself from time to time however do live frugally. I understand that I have an excess in my checking at this time. Any recommendations on what I should focus on next? Or what my next steps for investing should be? I was thinking some investments in precious metals (silver, gold, etc.), or collectibles (any recommendations are appreciated). \n\nThank you in advance. ",
          "author": "Big-Photo-6800",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 3,
          "created_utc": "2025-10-14T08:47:41",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o64mq5/35_yo_working_professional_where_do_i_go_from_here/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o64mq5/35_yo_working_professional_where_do_i_go_from_here/",
          "is_self": true,
          "over_18": false,
          "flair": "Other",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o64gc9",
          "title": "Student Loans Repayment//Balancing Budget",
          "content": "Hi! I need some financial advice.\n\nI’m a married U.S. citizen currently living in South Korea and working as an English teacher. I am in my late 20s. I make 4.0 million won per month, and after taxes, I take home 3.5 million won (about $2,400 USD with the current exchange rate). I will probably live in Korea for the next few years.\n\nEvery month, I send 1.2 million won (\\~$840 USD) to our joint account, which covers rent, utilities, groceries, and date nights.\n\nHere’s a breakdown of my monthly expenses:\n\n* Couples account: 1.2 million won (\\~$840)\n* Extra health insurance: 90,000 won (\\~$63)\n* Loan payment: 100,000 won (\\~$70)\n* Phone bill: 15,000 won (\\~$10)\n* Gym membership: 200,000 won (\\~$143)\n\nSavings:\n\n* $4,000 in a U.S. high-yield savings account\n* $4,000 in stocks\n* ₩6 million (\\~$4,000) in my Korean savings account \n   * I save about 1 mil won (\\~$700) from each paycheck. \n\nI need to start thinking about repaying my student loans, which total $50,000 from my master’s degree. I’m currently on the SAVE plan, so I don’t need to make payments until November 2028, but interest is accruing. My loans have 4.3% and 5.3% interest rates, and the estimated monthly payment would be around $500.\n\nThe exchange rate has been tough. It makes sending money to my U.S. account painful. Ideally, I’d like to find a higher-paying job in Korea, but my Korean isn’t very good or a remote job based in the U.S. However, the job market has been challenging, and a lot of remote listings seem unreliable.\n\nTo complicate things, I’m also pregnant and will be taking maternity leave soon. I’ll receive my full salary for the first two months, then a partial payment for the third month. After that, I’m considering taking the rest of the year off. The Korean government provides a small monthly stipend, but it’s not much. My husband works full-time, but I’d like to take personal responsibility for paying off my student loans rather than relying on him.\n\nGiven all this, I’d really appreciate any advice on how to manage my finances, especially balancing savings, student loans, and maternity leave while dealing with the unfavorable exchange rate. I know I should have more in my savings, retirement, etc, but I kind of figured out savings and stuff a little later. My parents aren’t much help with modeling healthy finances. My friends don’t seem to be super interested in savings and life planning. I feel like I’m playing catch up now. Also, I want to set up a savings account for my kid, so I should put away money for that. \n\n",
          "author": "Apprehensive_Pay_731",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T08:38:57",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o64gc9/student_loans_repaymentbalancing_budget/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o64gc9/student_loans_repaymentbalancing_budget/",
          "is_self": true,
          "over_18": false,
          "flair": "Debt",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o64cex",
          "title": "financial advisor fees based on total assets or by account",
          "content": "i'm reviewing a new agreement from my financial advisor that i've worked with for a number of years.  i noticed - in this new agreement - i'm not sure about the original agreement - that the tiers are based on each account, not total assets being managed.  so, if i had 5 million dollars in 1 account, i'd pay 10k on the first 1m and 18k for the next 2m and 16k for the last 2m - a total of 44k.  however, if i spread the 5m evenly across 5 accounts, I'd pay 1% across the board - so $50k.  of course, i have a bunch of different accounts because some are pretax, some are post-tax, etc.  While I don't have $5m under management, I was surprised and felt like the \"per account\" provision seemed nickel and dime-y.  is that common / standard in the industry.\n\nas an aside, my shift key works intermittently, so, yeah, i know - if you've got millions under management maybe you could afford a new laptop with a working shift key...  ",
          "author": "soz99",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 7,
          "created_utc": "2025-10-14T08:33:34",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o64cex/financial_advisor_fees_based_on_total_assets_or/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o64cex/financial_advisor_fees_based_on_total_assets_or/",
          "is_self": true,
          "over_18": false,
          "flair": "Planning",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o64bcp",
          "title": "How do I calculate going from W2 to 1099",
          "content": "I work in an industry where 1099 is far more common than W2. I’ve been with my current company for 4 years. Today they posed the idea of having us go from W2 to 1099. I’m already making a third over my income via 1099 and I’m one of the last few who have a salaried role. The change does make sense BUT I have no idea how to actually calculate the amount I need to make on 1099 for it to be equivalent (+ some) to what I am now.\n\nCan someone please help me with the math and explain realistic tax benefits of 1099? \n\nCurrent: \n$69k salary in Georgia, bi-weekly\nBenefits: Health, Dental, Vision, Life, short term disability, long term disability. I pay ~$207 24 times a year. I do get 15 days PTO but I am 0% concerned about the PTO. No 401k matching. \n~$27k in 1099 income YTD (this is work I do on top of my salary and I cannot count on this being a consistent number next year) \n\nNew expenses w/ 1099: \nTo replace health and dental with an equivalent plan I am looking at $700/mo\n\n\nSo basically, how do I even find the number I would need from going full 1099 to be equal/better than salary? I don’t really get amazing benefits as-is but it seems like the amount owed in taxes call for a significant increase. \n\nTIA",
          "author": "Afraid_Inspection_37",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.4,
          "num_comments": 17,
          "created_utc": "2025-10-14T08:32:05",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o64bcp/how_do_i_calculate_going_from_w2_to_1099/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o64bcp/how_do_i_calculate_going_from_w2_to_1099/",
          "is_self": true,
          "over_18": false,
          "flair": "Taxes",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o647l2",
          "title": "Pay down mortgage or invest.",
          "content": "I am getting back roughly 10k (mostly solar rebate), and I need some convincing to drop it all on the mortgage. I just purchased a house about a year ago. Roughly 400k mortgage at 5.12% ir. \nMy thought process for throwing the chunk at the mortgage is to position myself for a refinance in the hope for a lesser monthly payment IF rates ever drop. FYI, I bought a house out of my budget. \n\nI feel like the smarter move would be to invest it in VOO and chill, right? ",
          "author": "Pino0036",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.29,
          "num_comments": 13,
          "created_utc": "2025-10-14T08:26:54",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o647l2/pay_down_mortgage_or_invest/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o647l2/pay_down_mortgage_or_invest/",
          "is_self": true,
          "over_18": false,
          "flair": "Investing",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o6433r",
          "title": "Cherry Financing for Dental?",
          "content": "Can you use Cherry to pay immediate family members dental expenses. My daughter needs her wisdom teeth removed (over 18), is this something that I can use to pay for her or is it meant for only my use? ",
          "author": "Alive_Garage9539",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 1,
          "created_utc": "2025-10-14T08:20:44",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o6433r/cherry_financing_for_dental/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o6433r/cherry_financing_for_dental/",
          "is_self": true,
          "over_18": false,
          "flair": "Credit",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o63rgm",
          "title": "Without knowing any details, how much should I have saved up as a 35 year old?",
          "content": "All included. Savings account, checking, stocks, 401k, etc ",
          "author": "NovelOk5665",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.21,
          "num_comments": 23,
          "created_utc": "2025-10-14T08:05:22",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o63rgm/without_knowing_any_details_how_much_should_i/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o63rgm/without_knowing_any_details_how_much_should_i/",
          "is_self": true,
          "over_18": false,
          "flair": "Other",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o63fo4",
          "title": "Questions about Mega Backdoor Roth/aftertax gains conversions",
          "content": "Hi,  \nI have maxed out my ROTH IRA and is on track to max out my 401K with an employer's match. I had a little bit of excess aftertax contribution from last year that is currently just sitting there. I recently I called Fidelity to ask about potentially doing a Mega Backdoor Roth. They mentioned that my workplace allows Mega Backdoor Roth but it doesn't allow me to contribute to aftertax for 3 months after each time I move the money over. So I am planning to do the move in January since I know I'm close to maxing out my 401K for this year and may have excess funds as a result of that...\n\nTo move the aftertax gains, I have to pay tax right? What is the best move for the aftertax gains without making it too complicated?\n\nWhat do I have to look out for when I need to file tax returns? ",
          "author": "Sure_Doctor569",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.33,
          "num_comments": 3,
          "created_utc": "2025-10-14T07:49:28",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o63fo4/questions_about_mega_backdoor_rothaftertax_gains/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o63fo4/questions_about_mega_backdoor_rothaftertax_gains/",
          "is_self": true,
          "over_18": false,
          "flair": "Retirement",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o639x0",
          "title": "Pay off mortgage early?",
          "content": "Strongly inclined to do so, but looking for arguments one way or the other. \n\n~30 year old couple. 310k+ HHI. 440k left on the mortgage. 6.8% rate. Planning to pay the place off within 4 years. Will probably be in this house for a decade or so. \n\nHCOL area and love the idea of not having to worry about having a place to live. Retirement is a tad low though. Like 170k between us. Still feeling like the security of paying it down outweighs, given the high interest rate and payment. \n",
          "author": "wcsib01",
          "subreddit": "personalfinance",
          "score": 2,
          "upvote_ratio": 0.58,
          "num_comments": 19,
          "created_utc": "2025-10-14T07:41:43",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o639x0/pay_off_mortgage_early/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o639x0/pay_off_mortgage_early/",
          "is_self": true,
          "over_18": false,
          "flair": "Housing",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o6354n",
          "title": "Missed payments joint issues",
          "content": "We have a joint account and we were behind 11 straight payments on a car loan. However it was not reported via phone call to us as it was $5 short and every time we made a bi weekly payment just kept resetting the time rbc says so we have been behind $5 each month. \n\nMy wife has no debt and pays off her credit cards in full each month. She has around 30k available with nothing owing each month.  How much will this destroy her credit and for how long if anyone has experienced something like this. \n\nMy score tanked as I had other debt but more worried about her score recovery due to this mishap. ",
          "author": "Gess1010",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 0.67,
          "num_comments": 3,
          "created_utc": "2025-10-14T07:35:13",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o6354n/missed_payments_joint_issues/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o6354n/missed_payments_joint_issues/",
          "is_self": true,
          "over_18": false,
          "flair": "Other",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o6333a",
          "title": "Utilizing Proceeds from House Sale",
          "content": "We’re in the process of moving and wondering how to best utilize/invest the proceeds from our house sale. \n\nWe’ll likely walk away with $200k cash from our current property. We’re buying our new house for $345k. \n\nWe’re quite behind on retirement savings. (43 years old, combined retirement savings of $200k.) \n\nShould we:\nA: Put the full $200k towards the new mortgage.\nB: Put enough towards our new mortgage to make our monthly payments affordable and invest the rest in 401ks/Roth IRAs. \nC: Something else. ",
          "author": "bestillandknow_4610",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 4,
          "created_utc": "2025-10-14T07:32:30",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o6333a/utilizing_proceeds_from_house_sale/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o6333a/utilizing_proceeds_from_house_sale/",
          "is_self": true,
          "over_18": false,
          "flair": "Housing",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o62thc",
          "title": "Just your average lost 18 year old",
          "content": "So Im planning on moving out this year and getting a Federal job, A big boy job if you will. Are taxes automatically taken out of my check? There wont be anyone banging my door down for their money and garnishing my wages right? Or Do i need to be filing something, keeping track of certain payments or receipts? I want to end up setting a good start for myself to maybe go into my own business. I know that will come with its own set of doors. ",
          "author": "FindingFantastic2817",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.29,
          "num_comments": 21,
          "created_utc": "2025-10-14T07:19:58",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o62thc/just_your_average_lost_18_year_old/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o62thc/just_your_average_lost_18_year_old/",
          "is_self": true,
          "over_18": false,
          "flair": "Taxes",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o62cpw",
          "title": "older car vs newer purchase - first job need advice",
          "content": "i am starting a new job that requires me to drive, \\~25km each way to work (some is highway) and then some driving as a part of the job between sites. i am a new grad making around 70k. I have the opportunity to take a family member's old car for free (just pay for the plates, a small repair) but am concerned about the safety, it's a 2006 toyota sedan without some safety features (ABS, passenger airbags) and a lot of kms, where I would reasonably expect to have to get another car within a couple years. \n\nmy other option is to buy a used car now, would be looking at something in the 8-12k range, model likely between 2012-2015 and would have to finance it as I cannot afford to pay in full right now. \n\nlooking for advice, on the fence about whether it is smarter to pay more for now and have a longer lasting, safer car but take a financial loss, or use the older car for a year or two until I can save enough to not have to finance it and even potentially get a slightly newer/nicer model. \n\nthank u! ",
          "author": "Significant_Ad_9408",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 7,
          "created_utc": "2025-10-14T06:57:59",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o62cpw/older_car_vs_newer_purchase_first_job_need_advice/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o62cpw/older_car_vs_newer_purchase_first_job_need_advice/",
          "is_self": true,
          "over_18": false,
          "flair": "Auto",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o61yeg",
          "title": "Easy Enrollment or Standard? Fidelity Choices, New User",
          "content": "Hello everyone! i’m 22 and recently got a job that offers 401k with fidelity. i’m trying to enroll but to be honest, i’m basically a beginner when it comes to retirement plans and investing so i don’t really know much.\n\nshould i pick the easy enrollment? if so how much %(8, 10, 12 pretax with 1% annual increase, invested in FID FREEDOM 2070 K)? and for standard enrollment, how much do i put in for pretax and roth ira?\n\ni would appreciate anyy tips / advice for finance as i’m only starting out on this journey, thank you guys so much!! :)",
          "author": "CocoNitro",
          "subreddit": "personalfinance",
          "score": 2,
          "upvote_ratio": 0.76,
          "num_comments": 6,
          "created_utc": "2025-10-14T06:39:34",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o61yeg/easy_enrollment_or_standard_fidelity_choices_new/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o61yeg/easy_enrollment_or_standard_fidelity_choices_new/",
          "is_self": true,
          "over_18": false,
          "flair": "Investing",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o61mur",
          "title": "Organizing savings or one lump category?",
          "content": "We have money in one savings account but for peace of mind, I have it allocated for different things (job loss/horrible luck, pet emergency, car repairs, home repairs). My question is, what percentage would you allocate for each of those or do you just have money in one allocation as \"Savings\" or \"Emergency Fund\". If so, what would fall into there? ",
          "author": "mountains_150",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 0.6,
          "num_comments": 5,
          "created_utc": "2025-10-14T06:24:39",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o61mur/organizing_savings_or_one_lump_category/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o61mur/organizing_savings_or_one_lump_category/",
          "is_self": true,
          "over_18": false,
          "flair": "Budgeting",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o61jpq",
          "title": "How should I invest 30% of my salary for the next 10 years?",
          "content": "I’m 22, make around $85k/year, and have no debt. I’m trying to put away over 30% of my paycheck every month and let it grow until I buy a house in my mid-30s. I’m hoping that with future raises, my savings will grow enough to cover a down payment on a nice home in about 10 years.\n\nRight now I’m torn between a few options:\n\n* High-Yield Savings Account\n* S&P 500\n* More diverse investments\n\nEssentially, I want something that'll grow for the next 10 or so years without requiring my attention or concern. I'm very new to finance, and any advice would be greatly appreciated!\n\n*If you were in my position, how would you allocate that 30%? Is there something I should do that's better?*",
          "author": "Fun-Hunter9246",
          "subreddit": "personalfinance",
          "score": 23,
          "upvote_ratio": 0.71,
          "num_comments": 29,
          "created_utc": "2025-10-14T06:20:35",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o61jpq/how_should_i_invest_30_of_my_salary_for_the_next/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o61jpq/how_should_i_invest_30_of_my_salary_for_the_next/",
          "is_self": true,
          "over_18": false,
          "flair": "Saving",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o61blm",
          "title": "[USA] New immigrant earning $50K — how do I position myself to succeed financially and professionally?",
          "content": "Hi everyone, I’m 31 and moved to the U.S. just over a year ago. I’ve been working for the past three months, earning about $50K per year. I live in Maryland and pay $1,100 per month in rent. It’s a bit on the high side, but I chose somewhere I’d feel comfortable and safe.\n\nI have about $2,000 in savings. I opened an account with Fidelity recently, but I haven’t started contributing to a 401(k) yet. Still figuring out if my employer offers a match and trying to understand how all of this works.\n\nRight now, I’m focused on upskilling, applying for new jobs, and building a stable financial foundation. I have experience in project management and policy work, and I believe I could earn more with the right opportunity. Long-term, I’d like to build a business in something like consulting or media.\n\nMy question is this:\nAs someone starting over in the U.S. with modest income, what habits, skills, and mindset should I be working on now to give myself the best shot at long-term success?\n\nI don’t want to rush into the wrong things or just chase money. I want to build the right foundation that will pay off over time.\n\nAny advice from others who’ve built from the ground up would really help.\n",
          "author": "Alive-Focus4390",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.47,
          "num_comments": 13,
          "created_utc": "2025-10-14T06:10:14",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o61blm/usa_new_immigrant_earning_50k_how_do_i_position/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o61blm/usa_new_immigrant_earning_50k_how_do_i_position/",
          "is_self": true,
          "over_18": false,
          "flair": "Planning",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o613z1",
          "title": "HYSA investment- what am I doing wrong?",
          "content": "Hi all! \nI have recently gotten into being more financially literate and prudent given the state of today’s economy. I see everyone talking about HYSAs as a good place to put money vs a regular savings account. The think is I have SOFI which is supposedly a HYSA (checking and savings) for the past 5 or so months and have about $700 in the savings but I haven’t seen much of a yield on this money. Is there a specific part of the SOFI HYSA I should be putting this money in? Like an investment part of it. My initial assumption was that the savings account was enough to grow the money. \nPs. I wasn’t expecting a windfall return but I’ve gotten no interest on the existing money (aka same if I’d left it in my regular bank savings). \nAm I doing something wrong here?? Thank you!",
          "author": "docpharm28",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.25,
          "num_comments": 15,
          "created_utc": "2025-10-14T06:00:22",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o613z1/hysa_investment_what_am_i_doing_wrong/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o613z1/hysa_investment_what_am_i_doing_wrong/",
          "is_self": true,
          "over_18": false,
          "flair": "Budgeting",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o611us",
          "title": "Company 401k transfer",
          "content": "Hi, im 63 years old. I have a company 401k in fidelity. Im leaving the company and i want to see what are my options with it without penalty. Im going to another job and want to transfer my 401k to my personal account, can i do so? Create a personal traditional ira account in fidelity and just transfer it? And if so, can i see some thing off it and withdraw it without penalty?",
          "author": "Joshuapb",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 7,
          "created_utc": "2025-10-14T05:57:42",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o611us/company_401k_transfer/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o611us/company_401k_transfer/",
          "is_self": true,
          "over_18": false,
          "flair": "Employment",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o60xkz",
          "title": "Prorated salary question",
          "content": "Hello! \n\nRecently put in my notice at a salaried job. Currently I’m salaried at 50 hrs a week on a 2 week pay period which averages to about 7 hrs a day. My final pay period I’m working the first 4 days of the period but they have me scheduled for 39 hrs in those 4 days (restaurant things) \n\nSo my question is, would I be getting prorated for 4 days or 39hrs (5.5 days)? I’m assuming 4 days would be all they are legally required? The state is Ohio if that matters.",
          "author": "Complex-Pollution380",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 6,
          "created_utc": "2025-10-14T05:52:15",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o60xkz/prorated_salary_question/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o60xkz/prorated_salary_question/",
          "is_self": true,
          "over_18": false,
          "flair": "Employment",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o60v52",
          "title": "More expensive house with big down payment, or cheaper house with smaller down payment (and put money in the market instead)?",
          "content": "My husband and I make nearly $300K before taxes and take home a little over $15K monthly after insurance, HSA, retirement, etc. We have two cars (one new but paid off), no pets, no debts. We travel often to visit family, and we go on an international vacation every year. Besides that, we live within our means: no luxury spending, groceries and meals out are reasonable, current rent is about 20% of our income. We save money every month.\n\nWe are on track with our retirement savings. Outside of retirement, we have about $200K in the market. We have about $550K in cash.\n\nTwo main \"issues\" with our current budget. First is that we have a baby on the way and will hopefully have two kids total. We both want to continue working, so daycare and preschool will be a big part of the monthly budget (local prices around $2k per kid). Plus the occasional babysitter. We've agreed to cut out some travel in the future, but that will only ease our budget slightly. Second is that we live in California, so housing is expensive. In spite of its many flaws, we both love California. This is my home state, and neither of us want to leave.\n\nAnyway, enough rationalizing our choice to live in this expensive place. We want to move out of our moldy 2br and into a larger place where we can raise a couple of kids. Considering how much cash we have, I think it'd be wise to put down a larger down payment, $250K. This would decrease our monthly costs but still leave us with a 1-year emergency fund. I also think that we can afford the monthly payment on an $800K house if we do this.\n\nMy husband would prefer to put down a smaller chunk (and put the cash into the market) and get a cheaper house, closer to $650K. His reasoning is that we can keep monthly expenses low, and we can access our money more easily from the market if we have any emergencies.\n\nI don't want us to get in over our heads, but the differences between houses at $650K and houses at $800K are pretty big. The houses I'm targeting are in better neighborhoods and have better schools. Not to mention, they are larger and typically newer/updated. I don't need a massive house, but a little space is nice.\n\nAm I being too picky? When I look at our funds, I feel that an $800K house with a larger down payment makes sense as an investment and fits with our monthly budget. My husband wants us to be cautious - I just feel he might be a little TOO risk-averse?\n\nedited for typos",
          "author": "crawlen",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.46,
          "num_comments": 31,
          "created_utc": "2025-10-14T05:49:10",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o60v52/more_expensive_house_with_big_down_payment_or/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o60v52/more_expensive_house_with_big_down_payment_or/",
          "is_self": true,
          "over_18": false,
          "flair": "Housing",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o60gv0",
          "title": "Graduating Soon — How Should I Prioritize My Investments?",
          "content": "I’m graduating soon and starting a job that pays very well for my age. I’ll have no debt, so I’m trying to figure out how to prioritize my investments and set up a solid foundation early on.\n\nMy plan right now:\n1.\tMax out my 401(k) match through my employer.\n2.\tMax out my Roth IRA for the year.\n3.\tInvest the rest in a taxable brokerage account, mainly in broad market ETFs like SPY, VTI, and VXUS (open to other recommendations like SCHD, QQQ, or VOO) (Drop other recs)\n\nFor my personal investment account, I’m thinking of something like:\n•80–85% ETFs / index funds\n•10–15% individual stocks (just a few companies I really believe in)\n•A small % of my salary dollar-cost averaging into Bitcoin each month\n\nI plan to live frugally and should have a good amount to save and invest a majority of my salary.\n\nIf you were my age, what would you do differently?\nHow would you tweak this allocation or strategy to set yourself up for the long term?",
          "author": "CaptialCrisis",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 0.67,
          "num_comments": 4,
          "created_utc": "2025-10-14T05:30:55",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o60gv0/graduating_soon_how_should_i_prioritize_my/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o60gv0/graduating_soon_how_should_i_prioritize_my/",
          "is_self": true,
          "over_18": false,
          "flair": "Investing",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o60dk9",
          "title": "Fear of being shamed by a financial advisor",
          "content": "",
          "author": "Superb_Tangerine221",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.25,
          "num_comments": 4,
          "created_utc": "2025-10-14T05:26:44",
          "url": "/r/personalfinance/comments/1o60d5l/fear_of_being_shamed_by_a_financial_advisor/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o60dk9/fear_of_being_shamed_by_a_financial_advisor/",
          "is_self": false,
          "over_18": false,
          "flair": "Planning",
          "domain": ""
        },
        {
          "id": "1o60ch7",
          "title": "Lost my Job and Need some Advice",
          "content": "I was recently laid off and although I do have some cash on hand. The job market is terrible and i am looking to unload some shares that I received through RSU's to get me through the next few months or until I can land a new job. What is the best approach here? Or what viable options do i have? Also what are some tax implications if do sell some of the shares.",
          "author": "akaplay786",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 5,
          "created_utc": "2025-10-14T05:25:22",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o60ch7/lost_my_job_and_need_some_advice/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o60ch7/lost_my_job_and_need_some_advice/",
          "is_self": true,
          "over_18": false,
          "flair": "Budgeting",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o608ua",
          "title": "Prioritizing Retirement Plans versus Debt consolidation?",
          "content": "Question: Should I continue maxing out 401K annual $23,500 contribution / ROTH IRA $7,000 while I still have debt or pull back on maxing 401K and maxing ROTH IRA to prioritize debt pay off? Only maxing my 401K but both wife and I’s ROTH IRA. I’m 31 years old.\n\n Background:\n\n401K: $84,000 and 18% return on investment this year. \n\nBrokerage Account (includes ROTH IRA): $86,000 and 23.5% return on investment over last few years. Max out annual contribution between wife and I ($7,000 each).\n\nDebt:\n\nVehicle: $25,000 owed at 3% to mother in law. No paperwork, just an agreement that I pay every month. I insisted I pay her interest, she offered 0%. \n\nStudent loans: $18,000 at 3.99%\n\nTravel Trailer: $12,000 at 9%.\n\nRight now we are just making monthly payments on the mentioned above debt totally $55,000. ",
          "author": "Cokedbear",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 3,
          "created_utc": "2025-10-14T05:20:54",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o608ua/prioritizing_retirement_plans_versus_debt/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o608ua/prioritizing_retirement_plans_versus_debt/",
          "is_self": true,
          "over_18": false,
          "flair": "Retirement",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5znyh",
          "title": "Student Loan has changed to having 0% APR",
          "content": "I went back to school to get my MS (work pays). As of recently, the APR on my student loan has been reduced down to 0% until October of next year. I’m assuming a lot of people would suggest that I paid it in full, but I’m thinking, I can maximize my money and maybe put all the money I would’ve made towards paying the loan into a HYSA until the final day of school and then just pay the loan in full. Any thoughts or suggestions?",
          "author": "BringTheLubeInRuben",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 0.53,
          "num_comments": 11,
          "created_utc": "2025-10-14T04:54:28",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5znyh/student_loan_has_changed_to_having_0_apr/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5znyh/student_loan_has_changed_to_having_0_apr/",
          "is_self": true,
          "over_18": false,
          "flair": "Budgeting",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5zl9z",
          "title": "Trying to Open Fidelity Account = Hassle. Should I just use Vanguard?? (Roth IRA)",
          "content": "I have decided to start a Roth IRA and max out contributions, as my retirement plan. Heard a lot of great things about Fidelity, so went to open my account with them this past week. They had trouble registering me because they said I was somewhere in the system, somehow, though I didn't have an account with them in the past (they confirmed this). I called customer service twice to get it opened. The first person was like, oh, we don't actually have you in the system, it's a glitch. Finally, the second person said to just go to an in-person Fidelity bank to open the Roth IRA. That in-person bank is 20 miles away.\n\nI have a 401k at Vanguard. Should I just use Vanguard to open my Roth IRA or is Fidelity worth the hassle??\n\nThank you",
          "author": "redwoodmonk",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 10,
          "created_utc": "2025-10-14T04:51:10",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5zl9z/trying_to_open_fidelity_account_hassle_should_i/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5zl9z/trying_to_open_fidelity_account_hassle_should_i/",
          "is_self": true,
          "over_18": false,
          "flair": "Retirement",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5yywa",
          "title": "Roth IRA mix at mid-70s age",
          "content": "I just learned that my mid-70s parents are 100% tech stocks in their Roth IRA. This seems way to risky. What would be a good asset mix at that age in Roth IRA? Would the mixture be any different for a traditional IRA?",
          "author": "Goodkat203",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 0.66,
          "num_comments": 9,
          "created_utc": "2025-10-14T04:24:36",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5yywa/roth_ira_mix_at_mid70s_age/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5yywa/roth_ira_mix_at_mid70s_age/",
          "is_self": true,
          "over_18": false,
          "flair": "Retirement",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5yimc",
          "title": "Recast + additional payments vs Lump Sum question",
          "content": "",
          "author": "notacapedcrusader",
          "subreddit": "personalfinance",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 4,
          "created_utc": "2025-10-14T04:05:12",
          "url": "/r/Mortgages/comments/1o5ok2s/recast_additional_payments_vs_lump_sum_question/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5yimc/recast_additional_payments_vs_lump_sum_question/",
          "is_self": false,
          "over_18": false,
          "flair": "Other",
          "domain": ""
        },
        {
          "id": "1o5yfm2",
          "title": "Getting a gift of index funds. Keep in the market or move to an HYSA?",
          "content": "Hello,\n\nMy wife and I are getting a gift of $100k in index of funds as part of an inheritance in the next couple weeks. We have $50k currently as an emergency fund in an HYSA. About $35k in a brokerage account outside of our retirements. \n\nNormally I feel like it would be a no brainer to leave it in the market until we need it for something but with the market volatility i was curious if people thought it was better to sell some or all of it and keep it tucked in an HYSA with the rest of our money. We are also hoping to buy a house soon and some if not most of that money will be used to make sure we can make a 25% down payment on a house. What would you all do?",
          "author": "Vanictonn",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 15,
          "created_utc": "2025-10-14T04:01:37",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5yfm2/getting_a_gift_of_index_funds_keep_in_the_market/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5yfm2/getting_a_gift_of_index_funds_keep_in_the_market/",
          "is_self": true,
          "over_18": false,
          "flair": "Planning",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5xgs5",
          "title": "Another Roth vs Traditional 401k question.",
          "content": "I’m married with 2 children, 29 years old and make $81,000 with raises in sight. I started investing for retirement with a Roth IRA in college putting $20-50 dollars in here and there and am on track to put ~ $6k this year. When I was hired for my current position a year ago, I opted for the Roth 401k out familiarity. That works out to 9% Roth for my contributions and 7.5% traditional for the match. Currently, my spouse is a SAHM till the kids are school aged (still about 4 years off). The only other deduction outside of the kids would be about $6,000 per year into an HSA. I figure as long as I am at the 12% bracket with our combined income and current deductions I should just keep the 401k in Roth right? Once a significant portion of my/our income is above 12% then switch to traditional? Thanks",
          "author": "CaterpillarSame1132",
          "subreddit": "personalfinance",
          "score": 3,
          "upvote_ratio": 1.0,
          "num_comments": 11,
          "created_utc": "2025-10-14T03:22:18",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5xgs5/another_roth_vs_traditional_401k_question/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5xgs5/another_roth_vs_traditional_401k_question/",
          "is_self": true,
          "over_18": false,
          "flair": "Retirement",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5wqyr",
          "title": "$3000 debt, been barely making payments, but just got a check from a car crash that is enough to clear the whole thing",
          "content": "For context I have ~$1200 credit card debt and ~$1200 debt from collections from a college class i took and i’m about to receive a fat check from a car crash i was in that’s enough to clear the whole thing. I’ve heard even when you can pay off your whole credit card, that it’ll hurt your score if you do it all at once. How should I go about paying it off? My credit went from ~750 down to 550 because of these two marks and i’m trying to get it back up. \nI also heard not to pay collections directly, but i didn’t know this life hack before “accepting” the debt. So i’ve made two $100 payments already but more payments have rejected. The original debt was around $700 before it went to collections. Please no judgement i was almost homeless like four times this month \n ",
          "author": "Upset-Speed-2903",
          "subreddit": "personalfinance",
          "score": 36,
          "upvote_ratio": 0.79,
          "num_comments": 40,
          "created_utc": "2025-10-14T02:54:27",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5wqyr/3000_debt_been_barely_making_payments_but_just/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5wqyr/3000_debt_been_barely_making_payments_but_just/",
          "is_self": true,
          "over_18": false,
          "flair": "Auto",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5wox8",
          "title": "Bought a new car and I left my check book in the glove box",
          "content": "This is a two part question I recently traded in my old car for a new car and purchased it with a cashiers check I realized a day later I left my check book in the glove box.\n\nMy first question is I canceled all my checks relating to that check book but should I close my bank account as well?\n\nSecond question is if I close my bank account I want to make sure that will not affect the cashiers check I did notice the funds were already debited out of my account I just want confirmation and to double check.",
          "author": "DarthFuf",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.33,
          "num_comments": 34,
          "created_utc": "2025-10-14T02:52:17",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5wox8/bought_a_new_car_and_i_left_my_check_book_in_the/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5wox8/bought_a_new_car_and_i_left_my_check_book_in_the/",
          "is_self": true,
          "over_18": false,
          "flair": "Auto",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5wnyh",
          "title": "I'm very worried about my financial future but I'm not sure what to do.....",
          "content": "Since getting out of grad school in 2003 I took any job I could get, I was unemployed / underemployed for most of the last 20 years. I am now 48, I have no debt, I manage to save about $2k a month and I have about $50k in savings...I live in the NYC tri-state area, I rent and have no assets and I really don't feel very financially secure. I have stellar performance reviews at my current job, my responsibilities have doubled since starting and I get a 2% raise every year. Considering my expenses , I bring home less money now then when I started- been there 4 years but we're being threatened with layoffs. I'm fairly certain if I can find a new job I can make more money, but the idea of having to prove myself all over again and go through the initial \" over-working\" period ...it's just daunting. I feel like there is no job security....and I'm feeling my age....and I don't have the same energy to bust my ass...and I am scared for my future....",
          "author": "Choice-Crab-6114",
          "subreddit": "personalfinance",
          "score": 39,
          "upvote_ratio": 0.81,
          "num_comments": 22,
          "created_utc": "2025-10-14T02:51:14",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5wnyh/im_very_worried_about_my_financial_future_but_im/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5wnyh/im_very_worried_about_my_financial_future_but_im/",
          "is_self": true,
          "over_18": false,
          "flair": "Planning",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5wfqw",
          "title": "looking for advice about 401k",
          "content": "hello. i’m currently going through a separation and will be the sole provider of my three year old. i have a good amount of debt and no longer have a car. i currently have about 10k sitting in my 401k with my job. unfortunately i can’t do a withdrawal without a hardship or quitting, and a loan isn’t really an option right now. however, i saw on my pay and benefits website that i can convert that money to a IRA account and withdrawal from there. if i withdrawal under 5 years i pay a penalty. is this a long process and actually as it sounds? i’ve never done anything like this before and i need this money unfortunately within the next couple months. i’m aware it’s not a good decision to drain that money from my savings but i really have no choice with what’s going on in my life at the moment. thank you for any advice in advance ",
          "author": "underthesuffer",
          "subreddit": "personalfinance",
          "score": 4,
          "upvote_ratio": 1.0,
          "num_comments": 4,
          "created_utc": "2025-10-14T02:42:49",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5wfqw/looking_for_advice_about_401k/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5wfqw/looking_for_advice_about_401k/",
          "is_self": true,
          "over_18": false,
          "flair": "Debt",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5v2ol",
          "title": "Need help dealing with shady creditor.",
          "content": "A year ago I financed $7500 at 9.99%for tools and a toolbox. I have a weekly payment set up to come out on Tuesday of every week. I got a phone call from the creditor that the charges stop being processed and I had a $384 late payment and late fees. I asked them why it stopped being charged weekly, and they told me they just see an error with the account but couldn’t tell what the error was. \n\n I followed up with my bank and received documentation proving that everything on their side regarding my account was good. the bank said they just stopped receiving requests for the payment. This is the second time this has happened in the time I’ve been financing through this company. \n\nI call the financing company back and inform them everything on the banks side was good, and that I want to know what the error on my account was. Again they couldn’t tell me WHAT the error was. Just that there was an error. \n\nAt this point this seems almost fraudulent. I talked to my original sales rep and he told me this I’m not the first person this has happened to. I need help figuring out my best course of action. The company does not offer buybacks and I can’t afford to have a repossession on my credit score. ",
          "author": "bingeRy",
          "subreddit": "personalfinance",
          "score": 0,
          "upvote_ratio": 0.33,
          "num_comments": 11,
          "created_utc": "2025-10-14T01:52:45",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5v2ol/need_help_dealing_with_shady_creditor/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5v2ol/need_help_dealing_with_shady_creditor/",
          "is_self": true,
          "over_18": false,
          "flair": "Debt",
          "domain": "self.personalfinance"
        },
        {
          "id": "1o5utbi",
          "title": "Spouse 12 years older took social security at 67. Impact to me?",
          "content": "My wife is 12 years older than me and due to health longevity concerns at the time took her social security. I’ve always been the breadwinner and plan on taking my social security at 62 or 67. \n\nI’ve been reading on this forum and others about spouses getting the higher benefit when their partner retires. But this usually assumes a lower earning younger spouse who retires second (older man, younger woman). \n\nI’m having some challenges modeling the changes to both of our SSA benefits at both my potential retirement ages. \n\nWhat should I consider and watch out for? 4 more years to figure it out. ",
          "author": "fprintf",
          "subreddit": "personalfinance",
          "score": 75,
          "upvote_ratio": 0.78,
          "num_comments": 28,
          "created_utc": "2025-10-14T01:43:02",
          "url": "https://www.reddit.com/r/personalfinance/comments/1o5utbi/spouse_12_years_older_took_social_security_at_67/",
          "permalink": "https://reddit.com/r/personalfinance/comments/1o5utbi/spouse_12_years_older_took_social_security_at_67/",
          "is_self": true,
          "over_18": false,
          "flair": "Retirement",
          "domain": "self.personalfinance"
        }
      ]
    },
    "EarningOnline": {
      "info": {
        "name": "EarningOnline",
        "title": "Earning a Living Online",
        "subscribers": 19241,
        "description": "No description"
      },
      "new_posts_count": 0,
      "posts": []
    },
    "beermoney": {
      "info": {
        "name": "beermoney",
        "title": "Beermoney: Make money online",
        "subscribers": 1446593,
        "description": "###[IF YOU'RE NEW HERE, PLEASE READ THIS STICKY](https://www.reddit.com/r/beermoney/comments/1kro2bh/most_common_beer_money_sites_do_not_create/) AND [OUR FAQ](https://www.reddit.com/r/beermoney/wiki/"
      },
      "new_posts_count": 2,
      "posts": [
        {
          "id": "1o5s48q",
          "title": "Is it legal/safe to provide personal bank details for software/system tester work?",
          "content": "I do sidegig software/system tester work, and sometimes get invites that require using my personal bank account for testing. I've declined a few because I'm uncomfortable sharing those details.\n\nJust wondering how legal or safe is it to be involved in this kind of testing? Has anyone here had similar experiences, even on other platforms? Curious to hear your thoughts.",
          "author": "debugger_bugkiller",
          "subreddit": "beermoney",
          "score": 5,
          "upvote_ratio": 1.0,
          "num_comments": 4,
          "created_utc": "2025-10-14T00:05:46",
          "url": "https://www.reddit.com/r/beermoney/comments/1o5s48q/is_it_legalsafe_to_provide_personal_bank_details/",
          "permalink": "https://reddit.com/r/beermoney/comments/1o5s48q/is_it_legalsafe_to_provide_personal_bank_details/",
          "is_self": true,
          "over_18": false,
          "flair": "Question",
          "domain": "self.beermoney"
        },
        {
          "id": "1o5c1jv",
          "title": "🔥 CashInStyle App Launch Giveaway 📱 - $100 USD (4x $25) Amazon.com Gift Card Giveaway",
          "content": "# [CashInStyle](https://cashinstyle.com/?ref=beermoneyUS):\n\n[CashInStyle](https://cashinstyle.com/?ref=beermoneyUS) is a rewards and loyalty program website launched by the former **founders of YourSurveys** and Points2Shop, two well-known names in the survey industry. CashInStyle lets users earn cash by participating in a variety of online activities such as playing games, completing surveys, watching videos, downloading apps, shopping through affiliated retailers and engaging in special offers.\n\n**Some of the things CashInStyle offers:**\n\n>‌• Offerwalls: **90% rates**; no need to make profit as to focus on growing surveys business\n\n>‌• Exclusive Survey Partnership: Cherries Surveys - a new model with **guaranteed payout**. These surveys pay every time. After enough time answering questions, you will automatically get a complete.\n\n>‌• Contests: Monthly & bi-weekly earnings; referral contests every 10 days.\n\n>‌• **$2 minimum** amount to withdrawal\n\n>• Withdrawal options include **PayPal, Tremendous** (gift cards) or **crypto** (Litecoin & Bitcoin). **Instant payouts** for eligible users (Gold+).\n\n[CashInStyle](https://cashinstyle.com/?ref=beermoneyUS) is available worldwide! Members from VN, EG, TR, IN, and ID can refer but not earn from offers. Sign up through BeerMoney custom link to earn a $2 bonus when you reach $10.\n\n🔥 **Big News: The CashInStyle App Is Here!** 📱  \nOur biggest update yet, the official **CashInStyle App** has launched! 🚀  \nEarn, track and withdraw smoother than ever, all from your phone.\n\n✨ **What’s New:**  \n👀 **Activity Tab:** See live completions & withdrawals in real time → [CashInStyle Activity](https://cashinstyle.com/activity_stream)  \n💸 **Faster Withdrawals:** New “Max Funds” button + improved speed & stability  \n🎉 **8,000 Discord Members:** Thank you for growing with us! 💜\n\n⚓ **Top Offers:** Reign of Pirates & Sea of Conquest now with **Daily Cashback (via Torox)**\n\n✨ September was incredible record growth, contests and amazing community energy all around! 🚀 October is already off to a strong start especially with the **launch of our brand-new CashInStyle App** 📱 and there’s plenty more excitement to come!\n\n# [Get started here](https://cashinstyle.com/?ref=beermoneyUS)\n\n&nbsp;\n\n----\n\n#Requirements:\n\nYou must have posted on reddit prior to today and within the last 12 months. Removed posts/comments, giveaway entries, referral chains, and other low effort or off topic posts/comments do not qualify. Leave a top level comment below to enter the giveaway.\n\n**Giveaway will end around October 19th 2025**\n\n&nbsp;\n\n----\n\n&nbsp;\n\n# Leave a top level comment (a comment that isn't a reply to another user's comment) below to be entered into this giveaway! Any unrelated comments that aren't a giveaway entry will be removed.\n\n### Winners are chosen randomly with a script that was written for our giveaways and verified by our mods. After the giveaway ends, a new post will be made naming the winners for this giveaway. Stickying and posting this giveaway does not indicate endorsement or any affiliation with the above mentioned company.\n\n*Note: The moderators do not benefit in any way from this giveaway. This is all for you guys.*",
          "author": "beermoneymods",
          "subreddit": "beermoney",
          "score": 20,
          "upvote_ratio": 0.86,
          "num_comments": 118,
          "created_utc": "2025-10-13T11:46:17",
          "url": "https://www.reddit.com/r/beermoney/comments/1o5c1jv/cashinstyle_app_launch_giveaway_100_usd_4x_25/",
          "permalink": "https://reddit.com/r/beermoney/comments/1o5c1jv/cashinstyle_app_launch_giveaway_100_usd_4x_25/",
          "is_self": true,
          "over_18": false,
          "flair": "GIVEAWAY",
          "domain": "self.beermoney"
        }
      ]
    },
    "workonline": {
      "info": {
        "name": "workonline",
        "title": "Work Online",
        "subscribers": 687166,
        "description": "**r/WorkOnline** is a place to talk about making an income online.  This includes random jobs, online employers, remote work, sites that pay you and ways to monetize websites. These are sites and stra"
      },
      "new_posts_count": 5,
      "posts": [
        {
          "id": "1o628ei",
          "title": "Is OneForma glitchy and/or out of service?",
          "content": "Hi there! I wanted to ask if someone is having the same problem as me: The Oneforma platform seems to be really glitchy as of late, but I never had problems with my Task queue. I worked perfectly last week, but when I tried to login today, first I was faced with an \"Out of connection\" error. When I could finally login, my task queue was completely empty, as well as my job history/applied jobs etc. I can't even edit my payment or job information. \n\nIs someone else experimenting this? I've tried to fix the problem by clearing my cookies and such, but I can't simply log in to work on my task queue. I am a little baffled because the communication with my project team has been really good, and I haven't received any offboarding email... I sent an email to them just in case too, but I still wanted to ask.\nThank you for your answers in advance.",
          "author": "Miharuru",
          "subreddit": "WorkOnline",
          "score": 2,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:52:27",
          "url": "https://www.reddit.com/r/WorkOnline/comments/1o628ei/is_oneforma_glitchy_andor_out_of_service/",
          "permalink": "https://reddit.com/r/WorkOnline/comments/1o628ei/is_oneforma_glitchy_andor_out_of_service/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.WorkOnline"
        },
        {
          "id": "1o61l8a",
          "title": "Should I get a pc or a Mac to apply for jobs to work remote?",
          "content": "I got a 19 MBP 16” but I don’t think companies will allow or want people using macOS to do their jobs. And plus with getting a pc, it’ll open me up to jobs that won’t send me equipment. I also want to try to get into drop shipping at some point and also to game. I want a ps5 but I feel I could do a pc and have a 3-1. Recommendations? Suggestions?",
          "author": "FitRaspberry8107",
          "subreddit": "WorkOnline",
          "score": 1,
          "upvote_ratio": 0.56,
          "num_comments": 9,
          "created_utc": "2025-10-14T06:22:32",
          "url": "https://www.reddit.com/r/WorkOnline/comments/1o61l8a/should_i_get_a_pc_or_a_mac_to_apply_for_jobs_to/",
          "permalink": "https://reddit.com/r/WorkOnline/comments/1o61l8a/should_i_get_a_pc_or_a_mac_to_apply_for_jobs_to/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.WorkOnline"
        },
        {
          "id": "1o5tow8",
          "title": "Entry Level Amazon Customer Support Agent",
          "content": "Does anyone work with Amazon remotely? I was curious about what the pay is and how the job is. This is my first time doing remote work and I’m nervous lol Do you have to stay at your house to work or can you take it to different places? Do they train you? ",
          "author": "sechampagne",
          "subreddit": "WorkOnline",
          "score": 5,
          "upvote_ratio": 0.86,
          "num_comments": 2,
          "created_utc": "2025-10-14T01:02:22",
          "url": "https://www.reddit.com/r/WorkOnline/comments/1o5tow8/entry_level_amazon_customer_support_agent/",
          "permalink": "https://reddit.com/r/WorkOnline/comments/1o5tow8/entry_level_amazon_customer_support_agent/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.WorkOnline"
        },
        {
          "id": "1o5iq2e",
          "title": "Question about Telus",
          "content": "Hi, I need advice.\n\nIs it a standard procedure for Telus to ask for a copy of your ID with all details fully visible, including personal numbers (like national ID numbers), for an AI data annotation job?\nI feel a bit uneasy about sharing this information.\n\nThe emails come from recruitment_genaiglobal@telusinternational.ai and no-reply@telusinternational.ai. The instructions say to submit the document through a provided link.\n\nIs this a normal procedure?\n\nThank you very much for any input! ",
          "author": "ProfessionalButton66",
          "subreddit": "WorkOnline",
          "score": 6,
          "upvote_ratio": 0.81,
          "num_comments": 3,
          "created_utc": "2025-10-13T18:16:26",
          "url": "https://www.reddit.com/r/WorkOnline/comments/1o5iq2e/question_about_telus/",
          "permalink": "https://reddit.com/r/WorkOnline/comments/1o5iq2e/question_about_telus/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.WorkOnline"
        },
        {
          "id": "1o5hst8",
          "title": "I see some people received payment today for the Polly project. Mine is still \"Ready to be paid.\" Is this normal, or should I do something?",
          "content": "",
          "author": "Capable_Tie_5921",
          "subreddit": "WorkOnline",
          "score": 5,
          "upvote_ratio": 0.79,
          "num_comments": 2,
          "created_utc": "2025-10-13T17:33:25",
          "url": "https://www.reddit.com/r/WorkOnline/comments/1o5hst8/i_see_some_people_received_payment_today_for_the/",
          "permalink": "https://reddit.com/r/WorkOnline/comments/1o5hst8/i_see_some_people_received_payment_today_for_the/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.WorkOnline"
        }
      ]
    },
    "search_results": {
      "query": "earnin",
      "new_posts_count": 23,
      "posts": [
        {
          "id": "1o6200g",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "ReferralNotReferal",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 1,
          "created_utc": "2025-10-14T06:41:36",
          "url": "https://www.reddit.com/r/ReferralNotReferal/comments/1o6200g/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/ReferralNotReferal/comments/1o6200g/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.ReferralNotReferal"
        },
        {
          "id": "1o61zrd",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "CoupynCom",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:41:16",
          "url": "https://www.reddit.com/r/CoupynCom/comments/1o61zrd/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/CoupynCom/comments/1o61zrd/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.CoupynCom"
        },
        {
          "id": "1o61zg1",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "cash4signups",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:40:53",
          "url": "https://www.reddit.com/r/cash4signups/comments/1o61zg1/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/cash4signups/comments/1o61zg1/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.cash4signups"
        },
        {
          "id": "1o61zab",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "promocodeland",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:40:41",
          "url": "https://www.reddit.com/r/promocodeland/comments/1o61zab/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/promocodeland/comments/1o61zab/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.promocodeland"
        },
        {
          "id": "1o61z3r",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "ReferralLinksNation",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:40:27",
          "url": "https://www.reddit.com/r/ReferralLinksNation/comments/1o61z3r/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/ReferralLinksNation/comments/1o61z3r/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.ReferralLinksNation"
        },
        {
          "id": "1o61yu1",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "ReferralLink",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 1,
          "created_utc": "2025-10-14T06:40:08",
          "url": "https://www.reddit.com/r/ReferralLink/comments/1o61yu1/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/ReferralLink/comments/1o61yu1/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.ReferralLink"
        },
        {
          "id": "1o61yl3",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "ReferralAffiliateCode",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 1,
          "created_utc": "2025-10-14T06:39:48",
          "url": "https://www.reddit.com/r/ReferralAffiliateCode/comments/1o61yl3/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/ReferralAffiliateCode/comments/1o61yl3/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.ReferralAffiliateCode"
        },
        {
          "id": "1o61y5t",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "Shopping_CouponDeals",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:39:15",
          "url": "https://www.reddit.com/r/Shopping_CouponDeals/comments/1o61y5t/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/Shopping_CouponDeals/comments/1o61y5t/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.Shopping_CouponDeals"
        },
        {
          "id": "1o61xuv",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "ThriftyLivingHub",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:38:51",
          "url": "https://www.reddit.com/r/ThriftyLivingHub/comments/1o61xuv/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/ThriftyLivingHub/comments/1o61xuv/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.ThriftyLivingHub"
        },
        {
          "id": "1o61xog",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "ReferalCodes",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:38:36",
          "url": "https://www.reddit.com/r/ReferalCodes/comments/1o61xog/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/ReferalCodes/comments/1o61xog/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.ReferalCodes"
        },
        {
          "id": "1o61xcf",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "Referral",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:38:09",
          "url": "https://www.reddit.com/r/Referral/comments/1o61xcf/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/Referral/comments/1o61xcf/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.Referral"
        },
        {
          "id": "1o61wv5",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are with no fee, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "Referring",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:37:33",
          "url": "https://www.reddit.com/r/Referring/comments/1o61wv5/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/Referring/comments/1o61wv5/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.Referring"
        },
        {
          "id": "1o61wbs",
          "title": "Gemsloot is literally one of the best platforms to make money in your free time",
          "content": "I highly recommend everyone to take a look at the [bonus arbitrage strategy guide](http://sidehustlegold.org/strategy) and also sign up for [Gemsloot](https://gemsloot.com/?aff=shg) (use this look for a bonus).\n\nThis is definitely the next best side hustle you can do after sweepstakes farming. Completing the SoFi arbitrage offer is an instant $20 profit in literally 2 minutes. WeBull and Moomoo total to about $55 each, and EarnIn is a free $90 but it takes maybe a day or two. Chime works but it's dependent on whenever you get your next direct deposit from your employer, but it's a free $480 as well.\n\nLiterally just a lot of free money here, and genuinely \\~$800 worth of payouts for about 1-hr of active work. Can't recommend it enough. ",
          "author": "lionpenguin88",
          "subreddit": "SideHustleGold",
          "score": 4,
          "upvote_ratio": 0.7,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:36:50",
          "url": "https://www.reddit.com/r/SideHustleGold/comments/1o61wbs/gemsloot_is_literally_one_of_the_best_platforms/",
          "permalink": "https://reddit.com/r/SideHustleGold/comments/1o61wbs/gemsloot_is_literally_one_of_the_best_platforms/",
          "is_self": true,
          "over_18": false,
          "flair": "Discussion / Tips",
          "domain": "self.SideHustleGold"
        },
        {
          "id": "1o61v98",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "UseMyReferral",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 1,
          "created_utc": "2025-10-14T06:35:33",
          "url": "https://www.reddit.com/r/UseMyReferral/comments/1o61v98/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/UseMyReferral/comments/1o61v98/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.UseMyReferral"
        },
        {
          "id": "1o61uxu",
          "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
          "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
          "author": "New_Abbreviations_64",
          "subreddit": "Referrallinks",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T06:35:08",
          "url": "https://www.reddit.com/r/Referrallinks/comments/1o61uxu/get_up_to_150day_cash_advance_before_payday_25/",
          "permalink": "https://reddit.com/r/Referrallinks/comments/1o61uxu/get_up_to_150day_cash_advance_before_payday_25/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.Referrallinks"
        },
        {
          "id": "1o5wxjs",
          "title": "EarnIn Easy $10 Referral Code",
          "content": "Hey, wanna get your paycheck faster? Join EarnIn with my link and get $10! Make any day your payday. Use my code: SAKIB.SAVE.2 or click here: https://referral.earnin.link/aSrf1Q\n\nI use this app pretty often, very clutch whenever I’m running low before a paycheck. Get yourself $10 with my code, and you don’t have to be forced to wait for your paycheck. \n\nAll you have to do is set up tip jar. I personally always tip 0$ 😭 and they might ask you to request a cash out, it can be any set number from your “available earnings” under the cash out section. Lmk if there’s any questions. Shouldn’t take too long for an easy $10",
          "author": "erenyeaqer",
          "subreddit": "Referrallinks",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T03:01:24",
          "url": "https://www.reddit.com/r/Referrallinks/comments/1o5wxjs/earnin_easy_10_referral_code/",
          "permalink": "https://reddit.com/r/Referrallinks/comments/1o5wxjs/earnin_easy_10_referral_code/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.Referrallinks"
        },
        {
          "id": "1o5wwe7",
          "title": "EarnIn Referral Code $10",
          "content": "",
          "author": "erenyeaqer",
          "subreddit": "Referring",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-14T03:00:14",
          "url": "https://referral.earnin.link/aSrf1Q",
          "permalink": "https://reddit.com/r/Referring/comments/1o5wwe7/earnin_referral_code_10/",
          "is_self": false,
          "over_18": false,
          "flair": null,
          "domain": "referral.earnin.link"
        },
        {
          "id": "1o5kaf8",
          "title": "I cant link payout method on facebook. It wont let me get past 4th step cause the button \"link payout method\" is greyed out even tho i fill my bank details. Plss help thank you",
          "content": "",
          "author": "Beneficial_Sock_4046",
          "subreddit": "facebook",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 1,
          "created_utc": "2025-10-13T19:21:55",
          "url": "https://www.reddit.com/gallery/1o5kaf8",
          "permalink": "https://reddit.com/r/facebook/comments/1o5kaf8/i_cant_link_payout_method_on_facebook_it_wont_let/",
          "is_self": false,
          "over_18": false,
          "flair": "Tech Support",
          "domain": "reddit.com"
        },
        {
          "id": "1o5h6kg",
          "title": "B4B please",
          "content": "Hey! Quick favor - could you help me boost my cash out limit on EarnIn?\nI use it to access my earnings daily instead of waiting for payday. Thanks! https://boost.earnin.link/p95R9Z",
          "author": "_bxxnji_",
          "subreddit": "EarninB4B",
          "score": 1,
          "upvote_ratio": 1.0,
          "num_comments": 0,
          "created_utc": "2025-10-13T17:02:10",
          "url": "https://www.reddit.com/r/EarninB4B/comments/1o5h6kg/b4b_please/",
          "permalink": "https://reddit.com/r/EarninB4B/comments/1o5h6kg/b4b_please/",
          "is_self": true,
          "over_18": false,
          "flair": null,
          "domain": "self.EarninB4B"
        },
        {
          "id": "1o5c5sb",
          "title": "Earn 90$ from EarnIn via Gemsloot!!! (USA only)",
          "content": "",
          "author": "simurger",
          "subreddit": "MakeEasyMoney",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 0,
          "created_utc": "2025-10-13T11:53:27",
          "url": "https://i.redd.it/pzgg1mhfotuf1.jpeg",
          "permalink": "https://reddit.com/r/MakeEasyMoney/comments/1o5c5sb/earn_90_from_earnin_via_gemsloot_usa_only/",
          "is_self": false,
          "over_18": false,
          "flair": null,
          "domain": "i.redd.it"
        },
        {
          "id": "1o5c4vw",
          "title": "Earn 90$ from EarnIn via Gemsloot!!! (USA only)",
          "content": "",
          "author": "simurger",
          "subreddit": "beercash",
          "score": 0,
          "upvote_ratio": 0.5,
          "num_comments": 0,
          "created_utc": "2025-10-13T11:51:57",
          "url": "https://i.redd.it/vlu6uii7otuf1.jpeg",
          "permalink": "https://reddit.com/r/beercash/comments/1o5c4vw/earn_90_from_earnin_via_gemsloot_usa_only/",
          "is_self": false,
          "over_18": false,
          "flair": null,
          "domain": "i.redd.it"
        },
        {
          "id": "1o5c46w",
          "title": "Earn 90$ from EarnIn via Gemsloot!!! (USA only)",
          "content": "",
          "author": "simurger",
          "subreddit": "SmartSavingsCollect",
          "score": 2,
          "upvote_ratio": 0.75,
          "num_comments": 0,
          "created_utc": "2025-10-13T11:50:50",
          "url": "https://i.redd.it/dwbqztf0otuf1.jpeg",
          "permalink": "https://reddit.com/r/SmartSavingsCollect/comments/1o5c46w/earn_90_from_earnin_via_gemsloot_usa_only/",
          "is_self": false,
          "over_18": false,
          "flair": null,
          "domain": "i.redd.it"
        },
        {
          "id": "1o5c38n",
          "title": "Earn 90$ from EarnIn via Gemsloot!!! (USA only)",
          "content": "",
          "author": "simurger",
          "subreddit": "ReferralAffiliateCode",
          "score": 1,
          "upvote_ratio": 0.66,
          "num_comments": 1,
          "created_utc": "2025-10-13T11:49:09",
          "url": "https://i.redd.it/4izq2popntuf1.jpeg",
          "permalink": "https://reddit.com/r/ReferralAffiliateCode/comments/1o5c38n/earn_90_from_earnin_via_gemsloot_usa_only/",
          "is_self": false,
          "over_18": false,
          "flair": null,
          "domain": "i.redd.it"
        }
      ]
    }
  },
  "posts": [
    {
      "id": "1o67812",
      "title": "Best banks for high yield saving accounts",
      "content": "Hey all, \n\nI'm looking for a bank that offers a savings account with minimal requirements and a competitive interest rate. What banks offer the best savings account interest yields that also don't come with a lot of catches and conditions? \n\nI am not very financially savvy, so any guidance will be greatly appreciated. \n\nThanks in advance. ",
      "author": "Super_Eye_5962",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 0.67,
      "num_comments": 2,
      "created_utc": "2025-10-14T11:07:36",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o67812/best_banks_for_high_yield_saving_accounts/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o67812/best_banks_for_high_yield_saving_accounts/",
      "is_self": true,
      "over_18": false,
      "flair": "Saving",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o674io",
      "title": "Rebuilding Credit and Saving for Down Payment for a Car",
      "content": "Hello to whoever is reading this. I wish I can add more flairs to this post. But anyways, I am trying to rebuild my life after losing pretty much everything. For me, I want to start off with rebuilding my credit score. My current score is a 550 according to Experian. Here are the following things that are on my credit report:\n\nCollection Accounts\n- Portfolio Recovery Associates: $1589. Defaulted on a credit card due to forgetting to changing payment methods.\n- Procollect Inc: $2599. Eviction due to unpaid rent, and fees that might have came up.\n\nLoans\n- Affirm: $215. I actually don’t remember what exact purchase this came from, and currently looking more into it.\n- Student loans because financial aid was not the best in my first and fourth year. (I’m still in college btw)\n\nCredit Cards\n- High Credit Utilization: I have a max credit amount of $1300 across 3 credit cards. The percentage was 109% due to my paycheck not aligning up and shit happening. I just paid off the full balance of one, so it should go down soon-ish, hopefully. \n\nMy end goal is to hopefully get enough to get an auto loan without a co-signer. What should I tackle on first, the debt collectors or the credit card balances? And, what are some other tips and ways to save to get to this far fetched goal.",
      "author": "SoWhoIsTitan",
      "subreddit": "personalfinance",
      "score": 2,
      "upvote_ratio": 1.0,
      "num_comments": 3,
      "created_utc": "2025-10-14T11:01:40",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o674io/rebuilding_credit_and_saving_for_down_payment_for/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o674io/rebuilding_credit_and_saving_for_down_payment_for/",
      "is_self": true,
      "over_18": false,
      "flair": "Credit",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o67253",
      "title": "Lock in with me fa da best Darkweb sites and forums on da market im showing everyone everything",
      "content": "",
      "author": "IndependentGoose8282",
      "subreddit": "cashadvanceapps",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 0,
      "created_utc": "2025-10-14T10:57:46",
      "url": "https://www.reddit.com/gallery/1o67253",
      "permalink": "https://reddit.com/r/cashadvanceapps/comments/1o67253/lock_in_with_me_fa_da_best_darkweb_sites_and/",
      "is_self": false,
      "over_18": false,
      "flair": null,
      "domain": "reddit.com"
    },
    {
      "id": "1o66z1v",
      "title": "Is it unwise to invest heavily  before I buy a house?",
      "content": "I have a chance to invest a good chunk of down payment that I have saved up into a different business venture. I feel good about this venture, but of course there are risks. Trying to gauge if it’s dumb to make a big investment before you have even purchased a house, or if it’s better to wait till you have a house and then use excess to invest? ",
      "author": "Phantasmadam",
      "subreddit": "personalfinance",
      "score": 2,
      "upvote_ratio": 0.75,
      "num_comments": 8,
      "created_utc": "2025-10-14T10:52:41",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o66z1v/is_it_unwise_to_invest_heavily_before_i_buy_a/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o66z1v/is_it_unwise_to_invest_heavily_before_i_buy_a/",
      "is_self": true,
      "over_18": false,
      "flair": "Planning",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o66qh8",
      "title": "Credit Building Situation",
      "content": "I currently have a credit score of 656 which is not terrible, but it used to be around 710 but i unfortunately had to basically blow my limit in an emergency room during an unpaid 2 month internship where i was making no money whatsoever at the time and couldn’t afford basically anything let alone a hospital trip. My current balance is 750 dollars which i will be fully paying off this week. How long do you think it would take to get my credit back above 700? I only have 1 Capital One Platinum card and I am 20 years old with 100% payment history but it is only 8 months old but the 97% credit utilization is what i think is hurting the most. i’m pretty un knowledgeable with credit so any help and advice ill take. ",
      "author": "Material-Dig-897",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "created_utc": "2025-10-14T10:39:06",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o66qh8/credit_building_situation/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o66qh8/credit_building_situation/",
      "is_self": true,
      "over_18": false,
      "flair": "Credit",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o66jma",
      "title": "Help moving from high fee managed Stifel account (bonds) to self managed brokerage",
      "content": "I have a friend that has large amount at Stifel where it's actively managed for about 20 years now.  They bought California municipal bonds because they're tax exempt, they were also told to buy Puerto Rico muni bonds as well, unfortunately it defaulted.\n\n  \nMy concern is the high fees (not to mention commission, and account \"wrap fees\").  I want them to instead buy Vanguard's VTEC ETF (California tax except muni bond ETF) with much lower fees.  But I'm unsure how they can proceed?  My friend also thinks it's a good idea to move to a lower fee as well, but is also unsure.  They think they should wait until each bond is called, and gradually transfer that money to a brokerage like Schwab or Fidelity and then they can manage itself and buy VTEC on their own.\n\nI don't think that's a good idea to prolong the process, and instead move the entire account over... but not sure how that works since it's muni bonds.  With stocks I know they can do an ACATS transfer I believe where the entire account and stocks that are held are transferred to the new brokerage.\n\nI would love to some help and guidance please. \n\n  \nThanks",
      "author": "Main-Pomelo-9976",
      "subreddit": "personalfinance",
      "score": 2,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "created_utc": "2025-10-14T10:28:08",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o66jma/help_moving_from_high_fee_managed_stifel_account/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o66jma/help_moving_from_high_fee_managed_stifel_account/",
      "is_self": true,
      "over_18": false,
      "flair": "Investing",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o66bqe",
      "title": "Chime Refuses to Refund Fraudulent Transaction on Stolen Card",
      "content": "My wife’s wallet was stolen after a break-in. We filed a police report within a few hours and called all of our card issuers. Everyone else refunded the fraudulent transactions - except for Chime.\n\nDespite providing the information about the police report and filing an appeal, Chime says that \"we have concluded no error occurred. Therefore, no funds will be credited to your account and this claim is considered closed.\"\n\nWe requested the documents supporting the decision and got nothing. We plan to file complaints with the BBB and CFPB. Any other ideas? \n\n",
      "author": "timothywilliams2017",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.4,
      "num_comments": 7,
      "created_utc": "2025-10-14T10:15:46",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o66bqe/chime_refuses_to_refund_fraudulent_transaction_on/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o66bqe/chime_refuses_to_refund_fraudulent_transaction_on/",
      "is_self": true,
      "over_18": false,
      "flair": "Credit",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o66auw",
      "title": "Should I sell RSUs now or hold for long-term growth?",
      "content": "Hey everyone,\nI’m looking for some perspective on whether it makes sense to sell my vested RSUs now or hold onto them because I believe in the company’s long-term growth.\n\nHere’s my situation:\n\nCash & Assets\n- Checking: $16,000\n- Investing account: $2,000\n- RSUs:\n* 3,518 shares($36,000 net if sold at current stock price & trading windows opens in couple weeks)\n* 15,034 shares unvested, full vested in 09/01/2029\n\t\n\nDebt\n- Personal loan: $29,855 ($571/mo) \n- Credit card 1: $2,326\n- Credit card 2: $6,953\n\nIncome & Bills\n- Take-home: $4,500/month\n- Expenses: $3,500/month (personal loan included in this)\n\nI already am planning to full pay both credit at End of month. Just need advice on the RSU part and the idea of the long term potential gain or being debt free in couple weeks",
      "author": "iggywxng",
      "subreddit": "personalfinance",
      "score": 2,
      "upvote_ratio": 1.0,
      "num_comments": 6,
      "created_utc": "2025-10-14T10:14:29",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o66auw/should_i_sell_rsus_now_or_hold_for_longterm_growth/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o66auw/should_i_sell_rsus_now_or_hold_for_longterm_growth/",
      "is_self": true,
      "over_18": false,
      "flair": "Debt",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o6613t",
      "title": "649 Starting credit score?",
      "content": "Today i downloaded credit karma and saw my credit score was 649, Im confused i thought it started at 0, additionally my credit involvement was a month ago because i just started my first year of college, but I haven’t paid much on it.",
      "author": "GetAChris",
      "subreddit": "personalfinance",
      "score": 3,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "created_utc": "2025-10-14T09:59:38",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o6613t/649_starting_credit_score/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o6613t/649_starting_credit_score/",
      "is_self": true,
      "over_18": false,
      "flair": "Credit",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o65zvu",
      "title": "Car Loan Paid Off but Credit Union Won’t Release Title",
      "content": "This is for a friend so I may not have all the details. \n\nHe purchased a car in summer of 2020. Recently he made the final payment on the loan by going to the credit union, asking the remaining balance, and paying it off in cash. They said the title would be mailed out soon after. Some weeks went by and he called the credit union to ask about the status of his title. That was when he was informed that because he had an outstanding personal loan with the credit union that was delinquent, they would not give him the title. So he and I are both confused on how to proceed. He owes the credit union about $13k and cannot afford payments right now due to medical bills and not having a great job. Is the car at risk of repossession? I don’t think it’s in collections (yet) so can he negotiate with the credit union a way to get his title? I guess I’m just wondering what the best course of action is next. ",
      "author": "armhole3162",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 3,
      "created_utc": "2025-10-14T09:57:48",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o65zvu/car_loan_paid_off_but_credit_union_wont_release/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o65zvu/car_loan_paid_off_but_credit_union_wont_release/",
      "is_self": true,
      "over_18": false,
      "flair": "Debt",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o65yc5",
      "title": "I Need to Know if my Dad Stole from Me",
      "content": "Hello! My apologies if I put this in the wrong place on reddit, I'm new to making posts.\n\nI am a married 21 year old woman and can't believe I am genuinely asking this.\nLet me back up\n\nAt 13 I had whats called a Bat Mitzvah where I was given 2,100 dollars. My parents(rightfully) held onto it. For while it was in my savings account that I had no access to but it exsisted. At around 16 my dad asks if I'd like to put it in stocks(I have no clue what kind of account it was, just that it was not an account I ever had access too). I said yes since I knew he was good with money(this is just a fact). I was told this money would be taken out to get a car after college.\n\nFlash forward to before getting married(20 years old), I am low contact with my parents for a lot reasons that I won't delve into in this post. I ask my dad to give the money. He had at this point been putting in 250 dollars a month and turned my 2,100 dollars into almost 9,000. He told me that he since has removed it from stocks to ensure that the money would be mine rather than the governments. Okay fine. He then told me that rather than taking it now I could keep it in stocks and turn it into down-payment of a house instead of just getting a car.\n\nHe then told me to make a new account and sent over some documents stating essentially that he would have full control of the money. I am very glad I did not make an account or sign any of this. I could tell this annoyed him, with him even saying my brother now had more money than me. His was in stocks and mine was in a savings account(which I once again, have no access to).\n\nNow to today, I am faced with a crushing realization that the only kinda of accounts that would exsist for minors, would in fact transfers the funds over to said minor when they came of age not get stuck in limbo like I was led to believe.\n\nI have no clue what do or even what kind of account would've allowed him to take things out of stocks. Maybe i was lied to about it being a junior account but that doesn't make sense why he would take it out of stocks?\n\nProbably relavent to mention all this happened on an E-Trades account and I have proof the money is in a savings account.\n\nAnyone have any idea of how this happened?\nI really don't want to talk to either parent though I'm sure I'll have to but I wondered what exactly should be done here. Thanks!",
      "author": "ElshineW",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 5,
      "created_utc": "2025-10-14T09:55:31",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o65yc5/i_need_to_know_if_my_dad_stole_from_me/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o65yc5/i_need_to_know_if_my_dad_stole_from_me/",
      "is_self": true,
      "over_18": false,
      "flair": "Investing",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o654e5",
      "title": "How much should I budget for a house? First real doctor job.",
      "content": "Long story short is I have been training for around 19 years to become a  transplant surgeon, and just got my first job offer. It’s in my wife’s dream location in a mid sized city in the south. We have one child and hope to have a few more. She is also a physician. \n\nMy offer is a three year contract 360k base with a 35k signing bonus, and 10m relocation stipend. Each year the base goes up 20k, and there’s a 25k “quality” bonus for vague but achievable things (signing notes and orders on time etc). \n\nMy wife has a full time gig and makes 210k now but she will go part time and will make 140-160k. \n\nSo our total gross take home for the next three years is roughly 550k/year. \n\n\nMy wife has her heart somewhat set on a 1.2m dollar home. With 6.25 interest I was quoted and taxes/insurance etc I think this is about 8k a month from a 25k monthly budget. \n\n\nThis is a big change for us financially and I just want to make sure we are being responsible. I thought my offer would be a little higher like 450 so I’m somewhat disappointed but I like the other aspects of the job - the quality of life and the support are really great. \n\nIs this financially advisable? Should we get a cheaper house? My wife and I both sort of took a pause and were like. Hmm. Should we worry about the house finance this much? Wouldn’t it be easier in our minds to go with a lower monthly payment?\n\n\nAny advice would be great. But specifically - are we being irresponsible ??\n\nThanks!",
      "author": "transplant_beans",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.45,
      "num_comments": 50,
      "created_utc": "2025-10-14T09:11:54",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o654e5/how_much_should_i_budget_for_a_house_first_real/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o654e5/how_much_should_i_budget_for_a_house_first_real/",
      "is_self": true,
      "over_18": false,
      "flair": "Budgeting",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o651zr",
      "title": "I got scammed but couldn't cancel the transaction because it wasn't \"working hours\"",
      "content": "I was working with what I thought was a customer service representative for a legitimate compensation when I realized I had been duped and instead of getting the compensation I was defrauded out of $3,500. It was the weekend and I immediately tried to let my credit union know as well as the transfer app but got messages from  both that I had to get back during working hours. Had I been able to get help, the pending charge could have been cancelled instead of going through. Helpful thoughts and suggestions?",
      "author": "Useful_Condition863",
      "subreddit": "personalfinance",
      "score": 10,
      "upvote_ratio": 0.66,
      "num_comments": 7,
      "created_utc": "2025-10-14T09:08:42",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o651zr/i_got_scammed_but_couldnt_cancel_the_transaction/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o651zr/i_got_scammed_but_couldnt_cancel_the_transaction/",
      "is_self": true,
      "over_18": false,
      "flair": "Other",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o651mv",
      "title": "Need Advice: Chapter 7 Bankruptcy vs. Credit Card Charge-Offs & Payment Plans (High Income Drop)",
      "content": "Hi everyone,\nI'm looking for solid advice regarding my next financial move. My biggest concern is whether I should proceed with filing Chapter 7 bankruptcy to eliminate my unsecured debt, or if pursuing charge-offs and negotiating payment arrangements is the better path. I have a consultation with a lawyer this Thursday, but I would appreciate any community insights beforehand.\n\nMy Current Financial Snapshot:\n\n• Primary Goal: Eliminate credit card debt to free up funds to start paying down my student loans.\n\n• Current Debt:\n\n• Unsecured Debt: Over $20,000 in credit card debt across 8 lines.\n\n• Student Loans: Approximately $45,000 (non-dischargeable).\n\n• Car Loan: Current on all payments; I intend to keep the car. (2,300 left)\n\n• Assets/Savings: I have virtually no assets remaining (I sold them to cover rent) and no savings at the moment. My case would likely be a \"no-asset\" Chapter 7.\n\nIncome History & Payment Crisis:\n\nMy ability to pay changed significantly this year:\n\n1. Old Job: Laid off from an $80,000/year job in January 2025.\n\n2. Unemployment: Spent six months on unemployment, making about 1/4 of my previous pay. During this time, I stopped making credit card payments to prioritize rent and the car payment.\n\n3. Current Job: Started a new full-time job in August 2025, but my pay is now roughly half of my old $80k salary (i.e., ~$40k/year).\nThe Core Question:\n\nGiven my extreme drop in income (which is favorable for the Chapter 7 Means Test) and the complete lack of savings or non-exempt assets, what is the community's best recommendation?… I’m applying to higher positions. I have a bachelors and 10+ event management and coordination experience. \n\n1. File Chapter 7: Wipe out the $20k+ in credit card debt quickly, achieve the \"fresh start,\" and immediately focus all funds on rebuilding savings and attacking \nthe student loans.\n\n2. Wait for Charge-Offs & Negotiate: Let the accounts charge off, face collections, and then try to negotiate settlement/payment plans with creditors.\n\nAny advice on navigating this choice is greatly appreciated. Thank you.",
      "author": "Solid_Secretary_7090",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.33,
      "num_comments": 1,
      "created_utc": "2025-10-14T09:08:14",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o651mv/need_advice_chapter_7_bankruptcy_vs_credit_card/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o651mv/need_advice_chapter_7_bankruptcy_vs_credit_card/",
      "is_self": true,
      "over_18": false,
      "flair": "Credit",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o64mq5",
      "title": "35 YO Working Professional - Where do I go from here?",
      "content": "Hello. I currently work in healthcare and live on the West Coast. Currently mid-30s and looking for long-term planning/advice. \n\nIncome: $350k/yr\n\nTotal Loan Burden: \\~380K - plan on PSLF with monthly payments at about 1500/mo right now (to get up to 120 payments for forgiveness). Currently about half-way through. \n\nMonthly expenses are minimal - total of about 4K. (Live alone, apartment, no significant expenses at this time)\n\nTotal in various Investment Portfolios (retirement account, individual brokerage account, other accounts): \n\n1. Brokerage: Primarily index funds with a mixture of healthcare, goods, banking, energy, technology, pharmaceuticals. \\~$200,000\n2. Retirement: All SP500 Index Funds. \\~$180,000. I max out all relevant employee retirement plans (403b via pre-tax contributions and a 457. Contributions are maxed out every year). \n\nSavings: \\~$45,000\n\nChecking: \\~$90,000\n\nI spend on myself from time to time however do live frugally. I understand that I have an excess in my checking at this time. Any recommendations on what I should focus on next? Or what my next steps for investing should be? I was thinking some investments in precious metals (silver, gold, etc.), or collectibles (any recommendations are appreciated). \n\nThank you in advance. ",
      "author": "Big-Photo-6800",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 3,
      "created_utc": "2025-10-14T08:47:41",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o64mq5/35_yo_working_professional_where_do_i_go_from_here/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o64mq5/35_yo_working_professional_where_do_i_go_from_here/",
      "is_self": true,
      "over_18": false,
      "flair": "Other",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o64gc9",
      "title": "Student Loans Repayment//Balancing Budget",
      "content": "Hi! I need some financial advice.\n\nI’m a married U.S. citizen currently living in South Korea and working as an English teacher. I am in my late 20s. I make 4.0 million won per month, and after taxes, I take home 3.5 million won (about $2,400 USD with the current exchange rate). I will probably live in Korea for the next few years.\n\nEvery month, I send 1.2 million won (\\~$840 USD) to our joint account, which covers rent, utilities, groceries, and date nights.\n\nHere’s a breakdown of my monthly expenses:\n\n* Couples account: 1.2 million won (\\~$840)\n* Extra health insurance: 90,000 won (\\~$63)\n* Loan payment: 100,000 won (\\~$70)\n* Phone bill: 15,000 won (\\~$10)\n* Gym membership: 200,000 won (\\~$143)\n\nSavings:\n\n* $4,000 in a U.S. high-yield savings account\n* $4,000 in stocks\n* ₩6 million (\\~$4,000) in my Korean savings account \n   * I save about 1 mil won (\\~$700) from each paycheck. \n\nI need to start thinking about repaying my student loans, which total $50,000 from my master’s degree. I’m currently on the SAVE plan, so I don’t need to make payments until November 2028, but interest is accruing. My loans have 4.3% and 5.3% interest rates, and the estimated monthly payment would be around $500.\n\nThe exchange rate has been tough. It makes sending money to my U.S. account painful. Ideally, I’d like to find a higher-paying job in Korea, but my Korean isn’t very good or a remote job based in the U.S. However, the job market has been challenging, and a lot of remote listings seem unreliable.\n\nTo complicate things, I’m also pregnant and will be taking maternity leave soon. I’ll receive my full salary for the first two months, then a partial payment for the third month. After that, I’m considering taking the rest of the year off. The Korean government provides a small monthly stipend, but it’s not much. My husband works full-time, but I’d like to take personal responsibility for paying off my student loans rather than relying on him.\n\nGiven all this, I’d really appreciate any advice on how to manage my finances, especially balancing savings, student loans, and maternity leave while dealing with the unfavorable exchange rate. I know I should have more in my savings, retirement, etc, but I kind of figured out savings and stuff a little later. My parents aren’t much help with modeling healthy finances. My friends don’t seem to be super interested in savings and life planning. I feel like I’m playing catch up now. Also, I want to set up a savings account for my kid, so I should put away money for that. \n\n",
      "author": "Apprehensive_Pay_731",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T08:38:57",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o64gc9/student_loans_repaymentbalancing_budget/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o64gc9/student_loans_repaymentbalancing_budget/",
      "is_self": true,
      "over_18": false,
      "flair": "Debt",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o64cex",
      "title": "financial advisor fees based on total assets or by account",
      "content": "i'm reviewing a new agreement from my financial advisor that i've worked with for a number of years.  i noticed - in this new agreement - i'm not sure about the original agreement - that the tiers are based on each account, not total assets being managed.  so, if i had 5 million dollars in 1 account, i'd pay 10k on the first 1m and 18k for the next 2m and 16k for the last 2m - a total of 44k.  however, if i spread the 5m evenly across 5 accounts, I'd pay 1% across the board - so $50k.  of course, i have a bunch of different accounts because some are pretax, some are post-tax, etc.  While I don't have $5m under management, I was surprised and felt like the \"per account\" provision seemed nickel and dime-y.  is that common / standard in the industry.\n\nas an aside, my shift key works intermittently, so, yeah, i know - if you've got millions under management maybe you could afford a new laptop with a working shift key...  ",
      "author": "soz99",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 7,
      "created_utc": "2025-10-14T08:33:34",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o64cex/financial_advisor_fees_based_on_total_assets_or/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o64cex/financial_advisor_fees_based_on_total_assets_or/",
      "is_self": true,
      "over_18": false,
      "flair": "Planning",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o64bcp",
      "title": "How do I calculate going from W2 to 1099",
      "content": "I work in an industry where 1099 is far more common than W2. I’ve been with my current company for 4 years. Today they posed the idea of having us go from W2 to 1099. I’m already making a third over my income via 1099 and I’m one of the last few who have a salaried role. The change does make sense BUT I have no idea how to actually calculate the amount I need to make on 1099 for it to be equivalent (+ some) to what I am now.\n\nCan someone please help me with the math and explain realistic tax benefits of 1099? \n\nCurrent: \n$69k salary in Georgia, bi-weekly\nBenefits: Health, Dental, Vision, Life, short term disability, long term disability. I pay ~$207 24 times a year. I do get 15 days PTO but I am 0% concerned about the PTO. No 401k matching. \n~$27k in 1099 income YTD (this is work I do on top of my salary and I cannot count on this being a consistent number next year) \n\nNew expenses w/ 1099: \nTo replace health and dental with an equivalent plan I am looking at $700/mo\n\n\nSo basically, how do I even find the number I would need from going full 1099 to be equal/better than salary? I don’t really get amazing benefits as-is but it seems like the amount owed in taxes call for a significant increase. \n\nTIA",
      "author": "Afraid_Inspection_37",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.4,
      "num_comments": 17,
      "created_utc": "2025-10-14T08:32:05",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o64bcp/how_do_i_calculate_going_from_w2_to_1099/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o64bcp/how_do_i_calculate_going_from_w2_to_1099/",
      "is_self": true,
      "over_18": false,
      "flair": "Taxes",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o647l2",
      "title": "Pay down mortgage or invest.",
      "content": "I am getting back roughly 10k (mostly solar rebate), and I need some convincing to drop it all on the mortgage. I just purchased a house about a year ago. Roughly 400k mortgage at 5.12% ir. \nMy thought process for throwing the chunk at the mortgage is to position myself for a refinance in the hope for a lesser monthly payment IF rates ever drop. FYI, I bought a house out of my budget. \n\nI feel like the smarter move would be to invest it in VOO and chill, right? ",
      "author": "Pino0036",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.29,
      "num_comments": 13,
      "created_utc": "2025-10-14T08:26:54",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o647l2/pay_down_mortgage_or_invest/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o647l2/pay_down_mortgage_or_invest/",
      "is_self": true,
      "over_18": false,
      "flair": "Investing",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o6433r",
      "title": "Cherry Financing for Dental?",
      "content": "Can you use Cherry to pay immediate family members dental expenses. My daughter needs her wisdom teeth removed (over 18), is this something that I can use to pay for her or is it meant for only my use? ",
      "author": "Alive_Garage9539",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "created_utc": "2025-10-14T08:20:44",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o6433r/cherry_financing_for_dental/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o6433r/cherry_financing_for_dental/",
      "is_self": true,
      "over_18": false,
      "flair": "Credit",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o63rgm",
      "title": "Without knowing any details, how much should I have saved up as a 35 year old?",
      "content": "All included. Savings account, checking, stocks, 401k, etc ",
      "author": "NovelOk5665",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.21,
      "num_comments": 23,
      "created_utc": "2025-10-14T08:05:22",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o63rgm/without_knowing_any_details_how_much_should_i/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o63rgm/without_knowing_any_details_how_much_should_i/",
      "is_self": true,
      "over_18": false,
      "flair": "Other",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o63fo4",
      "title": "Questions about Mega Backdoor Roth/aftertax gains conversions",
      "content": "Hi,  \nI have maxed out my ROTH IRA and is on track to max out my 401K with an employer's match. I had a little bit of excess aftertax contribution from last year that is currently just sitting there. I recently I called Fidelity to ask about potentially doing a Mega Backdoor Roth. They mentioned that my workplace allows Mega Backdoor Roth but it doesn't allow me to contribute to aftertax for 3 months after each time I move the money over. So I am planning to do the move in January since I know I'm close to maxing out my 401K for this year and may have excess funds as a result of that...\n\nTo move the aftertax gains, I have to pay tax right? What is the best move for the aftertax gains without making it too complicated?\n\nWhat do I have to look out for when I need to file tax returns? ",
      "author": "Sure_Doctor569",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.33,
      "num_comments": 3,
      "created_utc": "2025-10-14T07:49:28",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o63fo4/questions_about_mega_backdoor_rothaftertax_gains/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o63fo4/questions_about_mega_backdoor_rothaftertax_gains/",
      "is_self": true,
      "over_18": false,
      "flair": "Retirement",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o639x0",
      "title": "Pay off mortgage early?",
      "content": "Strongly inclined to do so, but looking for arguments one way or the other. \n\n~30 year old couple. 310k+ HHI. 440k left on the mortgage. 6.8% rate. Planning to pay the place off within 4 years. Will probably be in this house for a decade or so. \n\nHCOL area and love the idea of not having to worry about having a place to live. Retirement is a tad low though. Like 170k between us. Still feeling like the security of paying it down outweighs, given the high interest rate and payment. \n",
      "author": "wcsib01",
      "subreddit": "personalfinance",
      "score": 2,
      "upvote_ratio": 0.58,
      "num_comments": 19,
      "created_utc": "2025-10-14T07:41:43",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o639x0/pay_off_mortgage_early/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o639x0/pay_off_mortgage_early/",
      "is_self": true,
      "over_18": false,
      "flair": "Housing",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o6354n",
      "title": "Missed payments joint issues",
      "content": "We have a joint account and we were behind 11 straight payments on a car loan. However it was not reported via phone call to us as it was $5 short and every time we made a bi weekly payment just kept resetting the time rbc says so we have been behind $5 each month. \n\nMy wife has no debt and pays off her credit cards in full each month. She has around 30k available with nothing owing each month.  How much will this destroy her credit and for how long if anyone has experienced something like this. \n\nMy score tanked as I had other debt but more worried about her score recovery due to this mishap. ",
      "author": "Gess1010",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 0.67,
      "num_comments": 3,
      "created_utc": "2025-10-14T07:35:13",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o6354n/missed_payments_joint_issues/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o6354n/missed_payments_joint_issues/",
      "is_self": true,
      "over_18": false,
      "flair": "Other",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o6333a",
      "title": "Utilizing Proceeds from House Sale",
      "content": "We’re in the process of moving and wondering how to best utilize/invest the proceeds from our house sale. \n\nWe’ll likely walk away with $200k cash from our current property. We’re buying our new house for $345k. \n\nWe’re quite behind on retirement savings. (43 years old, combined retirement savings of $200k.) \n\nShould we:\nA: Put the full $200k towards the new mortgage.\nB: Put enough towards our new mortgage to make our monthly payments affordable and invest the rest in 401ks/Roth IRAs. \nC: Something else. ",
      "author": "bestillandknow_4610",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 4,
      "created_utc": "2025-10-14T07:32:30",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o6333a/utilizing_proceeds_from_house_sale/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o6333a/utilizing_proceeds_from_house_sale/",
      "is_self": true,
      "over_18": false,
      "flair": "Housing",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o62thc",
      "title": "Just your average lost 18 year old",
      "content": "So Im planning on moving out this year and getting a Federal job, A big boy job if you will. Are taxes automatically taken out of my check? There wont be anyone banging my door down for their money and garnishing my wages right? Or Do i need to be filing something, keeping track of certain payments or receipts? I want to end up setting a good start for myself to maybe go into my own business. I know that will come with its own set of doors. ",
      "author": "FindingFantastic2817",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.29,
      "num_comments": 21,
      "created_utc": "2025-10-14T07:19:58",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o62thc/just_your_average_lost_18_year_old/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o62thc/just_your_average_lost_18_year_old/",
      "is_self": true,
      "over_18": false,
      "flair": "Taxes",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o62cpw",
      "title": "older car vs newer purchase - first job need advice",
      "content": "i am starting a new job that requires me to drive, \\~25km each way to work (some is highway) and then some driving as a part of the job between sites. i am a new grad making around 70k. I have the opportunity to take a family member's old car for free (just pay for the plates, a small repair) but am concerned about the safety, it's a 2006 toyota sedan without some safety features (ABS, passenger airbags) and a lot of kms, where I would reasonably expect to have to get another car within a couple years. \n\nmy other option is to buy a used car now, would be looking at something in the 8-12k range, model likely between 2012-2015 and would have to finance it as I cannot afford to pay in full right now. \n\nlooking for advice, on the fence about whether it is smarter to pay more for now and have a longer lasting, safer car but take a financial loss, or use the older car for a year or two until I can save enough to not have to finance it and even potentially get a slightly newer/nicer model. \n\nthank u! ",
      "author": "Significant_Ad_9408",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 7,
      "created_utc": "2025-10-14T06:57:59",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o62cpw/older_car_vs_newer_purchase_first_job_need_advice/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o62cpw/older_car_vs_newer_purchase_first_job_need_advice/",
      "is_self": true,
      "over_18": false,
      "flair": "Auto",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o628ei",
      "title": "Is OneForma glitchy and/or out of service?",
      "content": "Hi there! I wanted to ask if someone is having the same problem as me: The Oneforma platform seems to be really glitchy as of late, but I never had problems with my Task queue. I worked perfectly last week, but when I tried to login today, first I was faced with an \"Out of connection\" error. When I could finally login, my task queue was completely empty, as well as my job history/applied jobs etc. I can't even edit my payment or job information. \n\nIs someone else experimenting this? I've tried to fix the problem by clearing my cookies and such, but I can't simply log in to work on my task queue. I am a little baffled because the communication with my project team has been really good, and I haven't received any offboarding email... I sent an email to them just in case too, but I still wanted to ask.\nThank you for your answers in advance.",
      "author": "Miharuru",
      "subreddit": "WorkOnline",
      "score": 2,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:52:27",
      "url": "https://www.reddit.com/r/WorkOnline/comments/1o628ei/is_oneforma_glitchy_andor_out_of_service/",
      "permalink": "https://reddit.com/r/WorkOnline/comments/1o628ei/is_oneforma_glitchy_andor_out_of_service/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.WorkOnline"
    },
    {
      "id": "1o6200g",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "ReferralNotReferal",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "created_utc": "2025-10-14T06:41:36",
      "url": "https://www.reddit.com/r/ReferralNotReferal/comments/1o6200g/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/ReferralNotReferal/comments/1o6200g/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.ReferralNotReferal"
    },
    {
      "id": "1o61zrd",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "CoupynCom",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:41:16",
      "url": "https://www.reddit.com/r/CoupynCom/comments/1o61zrd/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/CoupynCom/comments/1o61zrd/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.CoupynCom"
    },
    {
      "id": "1o61zg1",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "cash4signups",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:40:53",
      "url": "https://www.reddit.com/r/cash4signups/comments/1o61zg1/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/cash4signups/comments/1o61zg1/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.cash4signups"
    },
    {
      "id": "1o61zab",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "promocodeland",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:40:41",
      "url": "https://www.reddit.com/r/promocodeland/comments/1o61zab/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/promocodeland/comments/1o61zab/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.promocodeland"
    },
    {
      "id": "1o61z3r",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "ReferralLinksNation",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:40:27",
      "url": "https://www.reddit.com/r/ReferralLinksNation/comments/1o61z3r/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/ReferralLinksNation/comments/1o61z3r/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.ReferralLinksNation"
    },
    {
      "id": "1o61yu1",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "ReferralLink",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "created_utc": "2025-10-14T06:40:08",
      "url": "https://www.reddit.com/r/ReferralLink/comments/1o61yu1/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/ReferralLink/comments/1o61yu1/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.ReferralLink"
    },
    {
      "id": "1o61yl3",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "ReferralAffiliateCode",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "created_utc": "2025-10-14T06:39:48",
      "url": "https://www.reddit.com/r/ReferralAffiliateCode/comments/1o61yl3/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/ReferralAffiliateCode/comments/1o61yl3/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.ReferralAffiliateCode"
    },
    {
      "id": "1o61yeg",
      "title": "Easy Enrollment or Standard? Fidelity Choices, New User",
      "content": "Hello everyone! i’m 22 and recently got a job that offers 401k with fidelity. i’m trying to enroll but to be honest, i’m basically a beginner when it comes to retirement plans and investing so i don’t really know much.\n\nshould i pick the easy enrollment? if so how much %(8, 10, 12 pretax with 1% annual increase, invested in FID FREEDOM 2070 K)? and for standard enrollment, how much do i put in for pretax and roth ira?\n\ni would appreciate anyy tips / advice for finance as i’m only starting out on this journey, thank you guys so much!! :)",
      "author": "CocoNitro",
      "subreddit": "personalfinance",
      "score": 2,
      "upvote_ratio": 0.76,
      "num_comments": 6,
      "created_utc": "2025-10-14T06:39:34",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o61yeg/easy_enrollment_or_standard_fidelity_choices_new/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o61yeg/easy_enrollment_or_standard_fidelity_choices_new/",
      "is_self": true,
      "over_18": false,
      "flair": "Investing",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o61y5t",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "Shopping_CouponDeals",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:39:15",
      "url": "https://www.reddit.com/r/Shopping_CouponDeals/comments/1o61y5t/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/Shopping_CouponDeals/comments/1o61y5t/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.Shopping_CouponDeals"
    },
    {
      "id": "1o61xuv",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "ThriftyLivingHub",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:38:51",
      "url": "https://www.reddit.com/r/ThriftyLivingHub/comments/1o61xuv/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/ThriftyLivingHub/comments/1o61xuv/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.ThriftyLivingHub"
    },
    {
      "id": "1o61xog",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "ReferalCodes",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:38:36",
      "url": "https://www.reddit.com/r/ReferalCodes/comments/1o61xog/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/ReferalCodes/comments/1o61xog/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.ReferalCodes"
    },
    {
      "id": "1o61xcf",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "Referral",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:38:09",
      "url": "https://www.reddit.com/r/Referral/comments/1o61xcf/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/Referral/comments/1o61xcf/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.Referral"
    },
    {
      "id": "1o61wv5",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are with no fee, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "Referring",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:37:33",
      "url": "https://www.reddit.com/r/Referring/comments/1o61wv5/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/Referring/comments/1o61wv5/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.Referring"
    },
    {
      "id": "1o61wbs",
      "title": "Gemsloot is literally one of the best platforms to make money in your free time",
      "content": "I highly recommend everyone to take a look at the [bonus arbitrage strategy guide](http://sidehustlegold.org/strategy) and also sign up for [Gemsloot](https://gemsloot.com/?aff=shg) (use this look for a bonus).\n\nThis is definitely the next best side hustle you can do after sweepstakes farming. Completing the SoFi arbitrage offer is an instant $20 profit in literally 2 minutes. WeBull and Moomoo total to about $55 each, and EarnIn is a free $90 but it takes maybe a day or two. Chime works but it's dependent on whenever you get your next direct deposit from your employer, but it's a free $480 as well.\n\nLiterally just a lot of free money here, and genuinely \\~$800 worth of payouts for about 1-hr of active work. Can't recommend it enough. ",
      "author": "lionpenguin88",
      "subreddit": "SideHustleGold",
      "score": 4,
      "upvote_ratio": 0.7,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:36:50",
      "url": "https://www.reddit.com/r/SideHustleGold/comments/1o61wbs/gemsloot_is_literally_one_of_the_best_platforms/",
      "permalink": "https://reddit.com/r/SideHustleGold/comments/1o61wbs/gemsloot_is_literally_one_of_the_best_platforms/",
      "is_self": true,
      "over_18": false,
      "flair": "Discussion / Tips",
      "domain": "self.SideHustleGold"
    },
    {
      "id": "1o61vx7",
      "title": "Revoke Ualett",
      "content": "Does anyone have experience with this? ",
      "author": "catrovert13",
      "subreddit": "cashadvanceapps",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "created_utc": "2025-10-14T06:36:20",
      "url": "https://www.reddit.com/r/cashadvanceapps/comments/1o61vx7/revoke_ualett/",
      "permalink": "https://reddit.com/r/cashadvanceapps/comments/1o61vx7/revoke_ualett/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.cashadvanceapps"
    },
    {
      "id": "1o61v98",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "UseMyReferral",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "created_utc": "2025-10-14T06:35:33",
      "url": "https://www.reddit.com/r/UseMyReferral/comments/1o61v98/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/UseMyReferral/comments/1o61v98/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.UseMyReferral"
    },
    {
      "id": "1o61uxu",
      "title": "Get up to $150/day cash advance before payday + $25 bonus with EarnIn — read below",
      "content": "A lot of people scroll past referral posts thinking they’re scams, so I’ll explain exactly how this one works so you can decide for yourself.  \n\n**What EarnIn is:**  \nEarnIn is a U.S. financial app that gives you early access to your earned wages — basically a cash advance from your own paycheck. You can access up to **$150 per day** (and up to **$750 per pay cycle**) safely and securely. There’s no loan, no credit check, and no interest.  \n\nYou link your payroll or bank account through **Plaid**, the same system most banks use for verification. Standard transfers are free, and optional “Lightning Speed” transfers just include a small fee. When payday arrives, EarnIn automatically balances the amount you withdrew.  \n\n**How the $25 bonus works:**  \n1. Use an official EarnIn referral link.  \n2. Sign up and connect your employer or payroll deposit source.  \n3. After your first successful cash-out, you’ll automatically receive **$25**.  \n4. Tipping is **completely optional** — it’s just a way to support the app if you want to.  \n\n**Why I share this:**  \nI use EarnIn myself to cover expenses when paychecks are delayed. It’s helped me stay on track and avoid overdraft or late fees. I do receive **$50** when someone completes their first cash-out, but I’m just glad to see people benefit from something that’s actually fair and transparent — especially compared to most payday or cash advance apps out there.  \n\nIf you’re considering trying it, read the terms below — this is straight from EarnIn’s official site.  \n\n**Full transparency:**  \n—  \nOfficial referral link (EarnIn website): [https://referral.earnin.link/oBOJ2U](https://referral.earnin.link/oBOJ2U)  \nReferral code: **ELIZ.SAVE.8**  \nBonus: You get **$25** after your first cash-out, and I receive **$50**.  \nTerms of Service: [https://www.earnin.com/terms-of-service](https://www.earnin.com/terms-of-service)  \nReferral Terms (effective July 17 2025): [https://www.earnin.com/referral-terms](https://www.earnin.com/referral-terms)  \n—  \n\nIf you’ve tried EarnIn or have questions, comment below — I’ll help you understand how to complete setup so you don’t miss your bonus.",
      "author": "New_Abbreviations_64",
      "subreddit": "Referrallinks",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T06:35:08",
      "url": "https://www.reddit.com/r/Referrallinks/comments/1o61uxu/get_up_to_150day_cash_advance_before_payday_25/",
      "permalink": "https://reddit.com/r/Referrallinks/comments/1o61uxu/get_up_to_150day_cash_advance_before_payday_25/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.Referrallinks"
    },
    {
      "id": "1o61mur",
      "title": "Organizing savings or one lump category?",
      "content": "We have money in one savings account but for peace of mind, I have it allocated for different things (job loss/horrible luck, pet emergency, car repairs, home repairs). My question is, what percentage would you allocate for each of those or do you just have money in one allocation as \"Savings\" or \"Emergency Fund\". If so, what would fall into there? ",
      "author": "mountains_150",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 0.6,
      "num_comments": 5,
      "created_utc": "2025-10-14T06:24:39",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o61mur/organizing_savings_or_one_lump_category/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o61mur/organizing_savings_or_one_lump_category/",
      "is_self": true,
      "over_18": false,
      "flair": "Budgeting",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o61l8a",
      "title": "Should I get a pc or a Mac to apply for jobs to work remote?",
      "content": "I got a 19 MBP 16” but I don’t think companies will allow or want people using macOS to do their jobs. And plus with getting a pc, it’ll open me up to jobs that won’t send me equipment. I also want to try to get into drop shipping at some point and also to game. I want a ps5 but I feel I could do a pc and have a 3-1. Recommendations? Suggestions?",
      "author": "FitRaspberry8107",
      "subreddit": "WorkOnline",
      "score": 1,
      "upvote_ratio": 0.56,
      "num_comments": 9,
      "created_utc": "2025-10-14T06:22:32",
      "url": "https://www.reddit.com/r/WorkOnline/comments/1o61l8a/should_i_get_a_pc_or_a_mac_to_apply_for_jobs_to/",
      "permalink": "https://reddit.com/r/WorkOnline/comments/1o61l8a/should_i_get_a_pc_or_a_mac_to_apply_for_jobs_to/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.WorkOnline"
    },
    {
      "id": "1o61jpq",
      "title": "How should I invest 30% of my salary for the next 10 years?",
      "content": "I’m 22, make around $85k/year, and have no debt. I’m trying to put away over 30% of my paycheck every month and let it grow until I buy a house in my mid-30s. I’m hoping that with future raises, my savings will grow enough to cover a down payment on a nice home in about 10 years.\n\nRight now I’m torn between a few options:\n\n* High-Yield Savings Account\n* S&P 500\n* More diverse investments\n\nEssentially, I want something that'll grow for the next 10 or so years without requiring my attention or concern. I'm very new to finance, and any advice would be greatly appreciated!\n\n*If you were in my position, how would you allocate that 30%? Is there something I should do that's better?*",
      "author": "Fun-Hunter9246",
      "subreddit": "personalfinance",
      "score": 23,
      "upvote_ratio": 0.71,
      "num_comments": 29,
      "created_utc": "2025-10-14T06:20:35",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o61jpq/how_should_i_invest_30_of_my_salary_for_the_next/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o61jpq/how_should_i_invest_30_of_my_salary_for_the_next/",
      "is_self": true,
      "over_18": false,
      "flair": "Saving",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o61blm",
      "title": "[USA] New immigrant earning $50K — how do I position myself to succeed financially and professionally?",
      "content": "Hi everyone, I’m 31 and moved to the U.S. just over a year ago. I’ve been working for the past three months, earning about $50K per year. I live in Maryland and pay $1,100 per month in rent. It’s a bit on the high side, but I chose somewhere I’d feel comfortable and safe.\n\nI have about $2,000 in savings. I opened an account with Fidelity recently, but I haven’t started contributing to a 401(k) yet. Still figuring out if my employer offers a match and trying to understand how all of this works.\n\nRight now, I’m focused on upskilling, applying for new jobs, and building a stable financial foundation. I have experience in project management and policy work, and I believe I could earn more with the right opportunity. Long-term, I’d like to build a business in something like consulting or media.\n\nMy question is this:\nAs someone starting over in the U.S. with modest income, what habits, skills, and mindset should I be working on now to give myself the best shot at long-term success?\n\nI don’t want to rush into the wrong things or just chase money. I want to build the right foundation that will pay off over time.\n\nAny advice from others who’ve built from the ground up would really help.\n",
      "author": "Alive-Focus4390",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.47,
      "num_comments": 13,
      "created_utc": "2025-10-14T06:10:14",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o61blm/usa_new_immigrant_earning_50k_how_do_i_position/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o61blm/usa_new_immigrant_earning_50k_how_do_i_position/",
      "is_self": true,
      "over_18": false,
      "flair": "Planning",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o613z1",
      "title": "HYSA investment- what am I doing wrong?",
      "content": "Hi all! \nI have recently gotten into being more financially literate and prudent given the state of today’s economy. I see everyone talking about HYSAs as a good place to put money vs a regular savings account. The think is I have SOFI which is supposedly a HYSA (checking and savings) for the past 5 or so months and have about $700 in the savings but I haven’t seen much of a yield on this money. Is there a specific part of the SOFI HYSA I should be putting this money in? Like an investment part of it. My initial assumption was that the savings account was enough to grow the money. \nPs. I wasn’t expecting a windfall return but I’ve gotten no interest on the existing money (aka same if I’d left it in my regular bank savings). \nAm I doing something wrong here?? Thank you!",
      "author": "docpharm28",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.25,
      "num_comments": 15,
      "created_utc": "2025-10-14T06:00:22",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o613z1/hysa_investment_what_am_i_doing_wrong/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o613z1/hysa_investment_what_am_i_doing_wrong/",
      "is_self": true,
      "over_18": false,
      "flair": "Budgeting",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o611us",
      "title": "Company 401k transfer",
      "content": "Hi, im 63 years old. I have a company 401k in fidelity. Im leaving the company and i want to see what are my options with it without penalty. Im going to another job and want to transfer my 401k to my personal account, can i do so? Create a personal traditional ira account in fidelity and just transfer it? And if so, can i see some thing off it and withdraw it without penalty?",
      "author": "Joshuapb",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 7,
      "created_utc": "2025-10-14T05:57:42",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o611us/company_401k_transfer/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o611us/company_401k_transfer/",
      "is_self": true,
      "over_18": false,
      "flair": "Employment",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o60xkz",
      "title": "Prorated salary question",
      "content": "Hello! \n\nRecently put in my notice at a salaried job. Currently I’m salaried at 50 hrs a week on a 2 week pay period which averages to about 7 hrs a day. My final pay period I’m working the first 4 days of the period but they have me scheduled for 39 hrs in those 4 days (restaurant things) \n\nSo my question is, would I be getting prorated for 4 days or 39hrs (5.5 days)? I’m assuming 4 days would be all they are legally required? The state is Ohio if that matters.",
      "author": "Complex-Pollution380",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 6,
      "created_utc": "2025-10-14T05:52:15",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o60xkz/prorated_salary_question/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o60xkz/prorated_salary_question/",
      "is_self": true,
      "over_18": false,
      "flair": "Employment",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o60v52",
      "title": "More expensive house with big down payment, or cheaper house with smaller down payment (and put money in the market instead)?",
      "content": "My husband and I make nearly $300K before taxes and take home a little over $15K monthly after insurance, HSA, retirement, etc. We have two cars (one new but paid off), no pets, no debts. We travel often to visit family, and we go on an international vacation every year. Besides that, we live within our means: no luxury spending, groceries and meals out are reasonable, current rent is about 20% of our income. We save money every month.\n\nWe are on track with our retirement savings. Outside of retirement, we have about $200K in the market. We have about $550K in cash.\n\nTwo main \"issues\" with our current budget. First is that we have a baby on the way and will hopefully have two kids total. We both want to continue working, so daycare and preschool will be a big part of the monthly budget (local prices around $2k per kid). Plus the occasional babysitter. We've agreed to cut out some travel in the future, but that will only ease our budget slightly. Second is that we live in California, so housing is expensive. In spite of its many flaws, we both love California. This is my home state, and neither of us want to leave.\n\nAnyway, enough rationalizing our choice to live in this expensive place. We want to move out of our moldy 2br and into a larger place where we can raise a couple of kids. Considering how much cash we have, I think it'd be wise to put down a larger down payment, $250K. This would decrease our monthly costs but still leave us with a 1-year emergency fund. I also think that we can afford the monthly payment on an $800K house if we do this.\n\nMy husband would prefer to put down a smaller chunk (and put the cash into the market) and get a cheaper house, closer to $650K. His reasoning is that we can keep monthly expenses low, and we can access our money more easily from the market if we have any emergencies.\n\nI don't want us to get in over our heads, but the differences between houses at $650K and houses at $800K are pretty big. The houses I'm targeting are in better neighborhoods and have better schools. Not to mention, they are larger and typically newer/updated. I don't need a massive house, but a little space is nice.\n\nAm I being too picky? When I look at our funds, I feel that an $800K house with a larger down payment makes sense as an investment and fits with our monthly budget. My husband wants us to be cautious - I just feel he might be a little TOO risk-averse?\n\nedited for typos",
      "author": "crawlen",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.46,
      "num_comments": 31,
      "created_utc": "2025-10-14T05:49:10",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o60v52/more_expensive_house_with_big_down_payment_or/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o60v52/more_expensive_house_with_big_down_payment_or/",
      "is_self": true,
      "over_18": false,
      "flair": "Housing",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o60gv0",
      "title": "Graduating Soon — How Should I Prioritize My Investments?",
      "content": "I’m graduating soon and starting a job that pays very well for my age. I’ll have no debt, so I’m trying to figure out how to prioritize my investments and set up a solid foundation early on.\n\nMy plan right now:\n1.\tMax out my 401(k) match through my employer.\n2.\tMax out my Roth IRA for the year.\n3.\tInvest the rest in a taxable brokerage account, mainly in broad market ETFs like SPY, VTI, and VXUS (open to other recommendations like SCHD, QQQ, or VOO) (Drop other recs)\n\nFor my personal investment account, I’m thinking of something like:\n•80–85% ETFs / index funds\n•10–15% individual stocks (just a few companies I really believe in)\n•A small % of my salary dollar-cost averaging into Bitcoin each month\n\nI plan to live frugally and should have a good amount to save and invest a majority of my salary.\n\nIf you were my age, what would you do differently?\nHow would you tweak this allocation or strategy to set yourself up for the long term?",
      "author": "CaptialCrisis",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 0.67,
      "num_comments": 4,
      "created_utc": "2025-10-14T05:30:55",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o60gv0/graduating_soon_how_should_i_prioritize_my/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o60gv0/graduating_soon_how_should_i_prioritize_my/",
      "is_self": true,
      "over_18": false,
      "flair": "Investing",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o60dk9",
      "title": "Fear of being shamed by a financial advisor",
      "content": "",
      "author": "Superb_Tangerine221",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.25,
      "num_comments": 4,
      "created_utc": "2025-10-14T05:26:44",
      "url": "/r/personalfinance/comments/1o60d5l/fear_of_being_shamed_by_a_financial_advisor/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o60dk9/fear_of_being_shamed_by_a_financial_advisor/",
      "is_self": false,
      "over_18": false,
      "flair": "Planning",
      "domain": ""
    },
    {
      "id": "1o60ch7",
      "title": "Lost my Job and Need some Advice",
      "content": "I was recently laid off and although I do have some cash on hand. The job market is terrible and i am looking to unload some shares that I received through RSU's to get me through the next few months or until I can land a new job. What is the best approach here? Or what viable options do i have? Also what are some tax implications if do sell some of the shares.",
      "author": "akaplay786",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 5,
      "created_utc": "2025-10-14T05:25:22",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o60ch7/lost_my_job_and_need_some_advice/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o60ch7/lost_my_job_and_need_some_advice/",
      "is_self": true,
      "over_18": false,
      "flair": "Budgeting",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o608ua",
      "title": "Prioritizing Retirement Plans versus Debt consolidation?",
      "content": "Question: Should I continue maxing out 401K annual $23,500 contribution / ROTH IRA $7,000 while I still have debt or pull back on maxing 401K and maxing ROTH IRA to prioritize debt pay off? Only maxing my 401K but both wife and I’s ROTH IRA. I’m 31 years old.\n\n Background:\n\n401K: $84,000 and 18% return on investment this year. \n\nBrokerage Account (includes ROTH IRA): $86,000 and 23.5% return on investment over last few years. Max out annual contribution between wife and I ($7,000 each).\n\nDebt:\n\nVehicle: $25,000 owed at 3% to mother in law. No paperwork, just an agreement that I pay every month. I insisted I pay her interest, she offered 0%. \n\nStudent loans: $18,000 at 3.99%\n\nTravel Trailer: $12,000 at 9%.\n\nRight now we are just making monthly payments on the mentioned above debt totally $55,000. ",
      "author": "Cokedbear",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 3,
      "created_utc": "2025-10-14T05:20:54",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o608ua/prioritizing_retirement_plans_versus_debt/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o608ua/prioritizing_retirement_plans_versus_debt/",
      "is_self": true,
      "over_18": false,
      "flair": "Retirement",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5znyh",
      "title": "Student Loan has changed to having 0% APR",
      "content": "I went back to school to get my MS (work pays). As of recently, the APR on my student loan has been reduced down to 0% until October of next year. I’m assuming a lot of people would suggest that I paid it in full, but I’m thinking, I can maximize my money and maybe put all the money I would’ve made towards paying the loan into a HYSA until the final day of school and then just pay the loan in full. Any thoughts or suggestions?",
      "author": "BringTheLubeInRuben",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 0.53,
      "num_comments": 11,
      "created_utc": "2025-10-14T04:54:28",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5znyh/student_loan_has_changed_to_having_0_apr/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5znyh/student_loan_has_changed_to_having_0_apr/",
      "is_self": true,
      "over_18": false,
      "flair": "Budgeting",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5zl9z",
      "title": "Trying to Open Fidelity Account = Hassle. Should I just use Vanguard?? (Roth IRA)",
      "content": "I have decided to start a Roth IRA and max out contributions, as my retirement plan. Heard a lot of great things about Fidelity, so went to open my account with them this past week. They had trouble registering me because they said I was somewhere in the system, somehow, though I didn't have an account with them in the past (they confirmed this). I called customer service twice to get it opened. The first person was like, oh, we don't actually have you in the system, it's a glitch. Finally, the second person said to just go to an in-person Fidelity bank to open the Roth IRA. That in-person bank is 20 miles away.\n\nI have a 401k at Vanguard. Should I just use Vanguard to open my Roth IRA or is Fidelity worth the hassle??\n\nThank you",
      "author": "redwoodmonk",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 10,
      "created_utc": "2025-10-14T04:51:10",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5zl9z/trying_to_open_fidelity_account_hassle_should_i/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5zl9z/trying_to_open_fidelity_account_hassle_should_i/",
      "is_self": true,
      "over_18": false,
      "flair": "Retirement",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5yywa",
      "title": "Roth IRA mix at mid-70s age",
      "content": "I just learned that my mid-70s parents are 100% tech stocks in their Roth IRA. This seems way to risky. What would be a good asset mix at that age in Roth IRA? Would the mixture be any different for a traditional IRA?",
      "author": "Goodkat203",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 0.66,
      "num_comments": 9,
      "created_utc": "2025-10-14T04:24:36",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5yywa/roth_ira_mix_at_mid70s_age/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5yywa/roth_ira_mix_at_mid70s_age/",
      "is_self": true,
      "over_18": false,
      "flair": "Retirement",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5yk14",
      "title": "Revoke Tilt?",
      "content": "Has anyone ever revoked ACH with Tilt? I'm in the process of changing jobs and my paydays will be wonky & they'll cut my advance down, and I can't afford to pay them back the full thing right now. They'd cute it from $150 to $25 last week, but I waited until today and they bumped it back up to $150. \n\nHas anyone successfully revoked with Tilt? Or are they like Dave and won't let you? ",
      "author": "JellyfishAccurate429",
      "subreddit": "cashadvanceapps",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 7,
      "created_utc": "2025-10-14T04:06:57",
      "url": "https://www.reddit.com/r/cashadvanceapps/comments/1o5yk14/revoke_tilt/",
      "permalink": "https://reddit.com/r/cashadvanceapps/comments/1o5yk14/revoke_tilt/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.cashadvanceapps"
    },
    {
      "id": "1o5yimc",
      "title": "Recast + additional payments vs Lump Sum question",
      "content": "",
      "author": "notacapedcrusader",
      "subreddit": "personalfinance",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "created_utc": "2025-10-14T04:05:12",
      "url": "/r/Mortgages/comments/1o5ok2s/recast_additional_payments_vs_lump_sum_question/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5yimc/recast_additional_payments_vs_lump_sum_question/",
      "is_self": false,
      "over_18": false,
      "flair": "Other",
      "domain": ""
    },
    {
      "id": "1o5yfm2",
      "title": "Getting a gift of index funds. Keep in the market or move to an HYSA?",
      "content": "Hello,\n\nMy wife and I are getting a gift of $100k in index of funds as part of an inheritance in the next couple weeks. We have $50k currently as an emergency fund in an HYSA. About $35k in a brokerage account outside of our retirements. \n\nNormally I feel like it would be a no brainer to leave it in the market until we need it for something but with the market volatility i was curious if people thought it was better to sell some or all of it and keep it tucked in an HYSA with the rest of our money. We are also hoping to buy a house soon and some if not most of that money will be used to make sure we can make a 25% down payment on a house. What would you all do?",
      "author": "Vanictonn",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 15,
      "created_utc": "2025-10-14T04:01:37",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5yfm2/getting_a_gift_of_index_funds_keep_in_the_market/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5yfm2/getting_a_gift_of_index_funds_keep_in_the_market/",
      "is_self": true,
      "over_18": false,
      "flair": "Planning",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5xgs5",
      "title": "Another Roth vs Traditional 401k question.",
      "content": "I’m married with 2 children, 29 years old and make $81,000 with raises in sight. I started investing for retirement with a Roth IRA in college putting $20-50 dollars in here and there and am on track to put ~ $6k this year. When I was hired for my current position a year ago, I opted for the Roth 401k out familiarity. That works out to 9% Roth for my contributions and 7.5% traditional for the match. Currently, my spouse is a SAHM till the kids are school aged (still about 4 years off). The only other deduction outside of the kids would be about $6,000 per year into an HSA. I figure as long as I am at the 12% bracket with our combined income and current deductions I should just keep the 401k in Roth right? Once a significant portion of my/our income is above 12% then switch to traditional? Thanks",
      "author": "CaterpillarSame1132",
      "subreddit": "personalfinance",
      "score": 3,
      "upvote_ratio": 1.0,
      "num_comments": 11,
      "created_utc": "2025-10-14T03:22:18",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5xgs5/another_roth_vs_traditional_401k_question/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5xgs5/another_roth_vs_traditional_401k_question/",
      "is_self": true,
      "over_18": false,
      "flair": "Retirement",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5wxjs",
      "title": "EarnIn Easy $10 Referral Code",
      "content": "Hey, wanna get your paycheck faster? Join EarnIn with my link and get $10! Make any day your payday. Use my code: SAKIB.SAVE.2 or click here: https://referral.earnin.link/aSrf1Q\n\nI use this app pretty often, very clutch whenever I’m running low before a paycheck. Get yourself $10 with my code, and you don’t have to be forced to wait for your paycheck. \n\nAll you have to do is set up tip jar. I personally always tip 0$ 😭 and they might ask you to request a cash out, it can be any set number from your “available earnings” under the cash out section. Lmk if there’s any questions. Shouldn’t take too long for an easy $10",
      "author": "erenyeaqer",
      "subreddit": "Referrallinks",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T03:01:24",
      "url": "https://www.reddit.com/r/Referrallinks/comments/1o5wxjs/earnin_easy_10_referral_code/",
      "permalink": "https://reddit.com/r/Referrallinks/comments/1o5wxjs/earnin_easy_10_referral_code/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.Referrallinks"
    },
    {
      "id": "1o5wwe7",
      "title": "EarnIn Referral Code $10",
      "content": "",
      "author": "erenyeaqer",
      "subreddit": "Referring",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-14T03:00:14",
      "url": "https://referral.earnin.link/aSrf1Q",
      "permalink": "https://reddit.com/r/Referring/comments/1o5wwe7/earnin_referral_code_10/",
      "is_self": false,
      "over_18": false,
      "flair": null,
      "domain": "referral.earnin.link"
    },
    {
      "id": "1o5wqyr",
      "title": "$3000 debt, been barely making payments, but just got a check from a car crash that is enough to clear the whole thing",
      "content": "For context I have ~$1200 credit card debt and ~$1200 debt from collections from a college class i took and i’m about to receive a fat check from a car crash i was in that’s enough to clear the whole thing. I’ve heard even when you can pay off your whole credit card, that it’ll hurt your score if you do it all at once. How should I go about paying it off? My credit went from ~750 down to 550 because of these two marks and i’m trying to get it back up. \nI also heard not to pay collections directly, but i didn’t know this life hack before “accepting” the debt. So i’ve made two $100 payments already but more payments have rejected. The original debt was around $700 before it went to collections. Please no judgement i was almost homeless like four times this month \n ",
      "author": "Upset-Speed-2903",
      "subreddit": "personalfinance",
      "score": 36,
      "upvote_ratio": 0.79,
      "num_comments": 40,
      "created_utc": "2025-10-14T02:54:27",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5wqyr/3000_debt_been_barely_making_payments_but_just/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5wqyr/3000_debt_been_barely_making_payments_but_just/",
      "is_self": true,
      "over_18": false,
      "flair": "Auto",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5wox8",
      "title": "Bought a new car and I left my check book in the glove box",
      "content": "This is a two part question I recently traded in my old car for a new car and purchased it with a cashiers check I realized a day later I left my check book in the glove box.\n\nMy first question is I canceled all my checks relating to that check book but should I close my bank account as well?\n\nSecond question is if I close my bank account I want to make sure that will not affect the cashiers check I did notice the funds were already debited out of my account I just want confirmation and to double check.",
      "author": "DarthFuf",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.33,
      "num_comments": 34,
      "created_utc": "2025-10-14T02:52:17",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5wox8/bought_a_new_car_and_i_left_my_check_book_in_the/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5wox8/bought_a_new_car_and_i_left_my_check_book_in_the/",
      "is_self": true,
      "over_18": false,
      "flair": "Auto",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5wnyh",
      "title": "I'm very worried about my financial future but I'm not sure what to do.....",
      "content": "Since getting out of grad school in 2003 I took any job I could get, I was unemployed / underemployed for most of the last 20 years. I am now 48, I have no debt, I manage to save about $2k a month and I have about $50k in savings...I live in the NYC tri-state area, I rent and have no assets and I really don't feel very financially secure. I have stellar performance reviews at my current job, my responsibilities have doubled since starting and I get a 2% raise every year. Considering my expenses , I bring home less money now then when I started- been there 4 years but we're being threatened with layoffs. I'm fairly certain if I can find a new job I can make more money, but the idea of having to prove myself all over again and go through the initial \" over-working\" period ...it's just daunting. I feel like there is no job security....and I'm feeling my age....and I don't have the same energy to bust my ass...and I am scared for my future....",
      "author": "Choice-Crab-6114",
      "subreddit": "personalfinance",
      "score": 39,
      "upvote_ratio": 0.81,
      "num_comments": 22,
      "created_utc": "2025-10-14T02:51:14",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5wnyh/im_very_worried_about_my_financial_future_but_im/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5wnyh/im_very_worried_about_my_financial_future_but_im/",
      "is_self": true,
      "over_18": false,
      "flair": "Planning",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5wfqw",
      "title": "looking for advice about 401k",
      "content": "hello. i’m currently going through a separation and will be the sole provider of my three year old. i have a good amount of debt and no longer have a car. i currently have about 10k sitting in my 401k with my job. unfortunately i can’t do a withdrawal without a hardship or quitting, and a loan isn’t really an option right now. however, i saw on my pay and benefits website that i can convert that money to a IRA account and withdrawal from there. if i withdrawal under 5 years i pay a penalty. is this a long process and actually as it sounds? i’ve never done anything like this before and i need this money unfortunately within the next couple months. i’m aware it’s not a good decision to drain that money from my savings but i really have no choice with what’s going on in my life at the moment. thank you for any advice in advance ",
      "author": "underthesuffer",
      "subreddit": "personalfinance",
      "score": 4,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "created_utc": "2025-10-14T02:42:49",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5wfqw/looking_for_advice_about_401k/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5wfqw/looking_for_advice_about_401k/",
      "is_self": true,
      "over_18": false,
      "flair": "Debt",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5v2ol",
      "title": "Need help dealing with shady creditor.",
      "content": "A year ago I financed $7500 at 9.99%for tools and a toolbox. I have a weekly payment set up to come out on Tuesday of every week. I got a phone call from the creditor that the charges stop being processed and I had a $384 late payment and late fees. I asked them why it stopped being charged weekly, and they told me they just see an error with the account but couldn’t tell what the error was. \n\n I followed up with my bank and received documentation proving that everything on their side regarding my account was good. the bank said they just stopped receiving requests for the payment. This is the second time this has happened in the time I’ve been financing through this company. \n\nI call the financing company back and inform them everything on the banks side was good, and that I want to know what the error on my account was. Again they couldn’t tell me WHAT the error was. Just that there was an error. \n\nAt this point this seems almost fraudulent. I talked to my original sales rep and he told me this I’m not the first person this has happened to. I need help figuring out my best course of action. The company does not offer buybacks and I can’t afford to have a repossession on my credit score. ",
      "author": "bingeRy",
      "subreddit": "personalfinance",
      "score": 0,
      "upvote_ratio": 0.33,
      "num_comments": 11,
      "created_utc": "2025-10-14T01:52:45",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5v2ol/need_help_dealing_with_shady_creditor/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5v2ol/need_help_dealing_with_shady_creditor/",
      "is_self": true,
      "over_18": false,
      "flair": "Debt",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5utbi",
      "title": "Spouse 12 years older took social security at 67. Impact to me?",
      "content": "My wife is 12 years older than me and due to health longevity concerns at the time took her social security. I’ve always been the breadwinner and plan on taking my social security at 62 or 67. \n\nI’ve been reading on this forum and others about spouses getting the higher benefit when their partner retires. But this usually assumes a lower earning younger spouse who retires second (older man, younger woman). \n\nI’m having some challenges modeling the changes to both of our SSA benefits at both my potential retirement ages. \n\nWhat should I consider and watch out for? 4 more years to figure it out. ",
      "author": "fprintf",
      "subreddit": "personalfinance",
      "score": 75,
      "upvote_ratio": 0.78,
      "num_comments": 28,
      "created_utc": "2025-10-14T01:43:02",
      "url": "https://www.reddit.com/r/personalfinance/comments/1o5utbi/spouse_12_years_older_took_social_security_at_67/",
      "permalink": "https://reddit.com/r/personalfinance/comments/1o5utbi/spouse_12_years_older_took_social_security_at_67/",
      "is_self": true,
      "over_18": false,
      "flair": "Retirement",
      "domain": "self.personalfinance"
    },
    {
      "id": "1o5tow8",
      "title": "Entry Level Amazon Customer Support Agent",
      "content": "Does anyone work with Amazon remotely? I was curious about what the pay is and how the job is. This is my first time doing remote work and I’m nervous lol Do you have to stay at your house to work or can you take it to different places? Do they train you? ",
      "author": "sechampagne",
      "subreddit": "WorkOnline",
      "score": 5,
      "upvote_ratio": 0.86,
      "num_comments": 2,
      "created_utc": "2025-10-14T01:02:22",
      "url": "https://www.reddit.com/r/WorkOnline/comments/1o5tow8/entry_level_amazon_customer_support_agent/",
      "permalink": "https://reddit.com/r/WorkOnline/comments/1o5tow8/entry_level_amazon_customer_support_agent/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.WorkOnline"
    },
    {
      "id": "1o5s48q",
      "title": "Is it legal/safe to provide personal bank details for software/system tester work?",
      "content": "I do sidegig software/system tester work, and sometimes get invites that require using my personal bank account for testing. I've declined a few because I'm uncomfortable sharing those details.\n\nJust wondering how legal or safe is it to be involved in this kind of testing? Has anyone here had similar experiences, even on other platforms? Curious to hear your thoughts.",
      "author": "debugger_bugkiller",
      "subreddit": "beermoney",
      "score": 5,
      "upvote_ratio": 1.0,
      "num_comments": 4,
      "created_utc": "2025-10-14T00:05:46",
      "url": "https://www.reddit.com/r/beermoney/comments/1o5s48q/is_it_legalsafe_to_provide_personal_bank_details/",
      "permalink": "https://reddit.com/r/beermoney/comments/1o5s48q/is_it_legalsafe_to_provide_personal_bank_details/",
      "is_self": true,
      "over_18": false,
      "flair": "Question",
      "domain": "self.beermoney"
    },
    {
      "id": "1o5kaf8",
      "title": "I cant link payout method on facebook. It wont let me get past 4th step cause the button \"link payout method\" is greyed out even tho i fill my bank details. Plss help thank you",
      "content": "",
      "author": "Beneficial_Sock_4046",
      "subreddit": "facebook",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 1,
      "created_utc": "2025-10-13T19:21:55",
      "url": "https://www.reddit.com/gallery/1o5kaf8",
      "permalink": "https://reddit.com/r/facebook/comments/1o5kaf8/i_cant_link_payout_method_on_facebook_it_wont_let/",
      "is_self": false,
      "over_18": false,
      "flair": "Tech Support",
      "domain": "reddit.com"
    },
    {
      "id": "1o5iq2e",
      "title": "Question about Telus",
      "content": "Hi, I need advice.\n\nIs it a standard procedure for Telus to ask for a copy of your ID with all details fully visible, including personal numbers (like national ID numbers), for an AI data annotation job?\nI feel a bit uneasy about sharing this information.\n\nThe emails come from recruitment_genaiglobal@telusinternational.ai and no-reply@telusinternational.ai. The instructions say to submit the document through a provided link.\n\nIs this a normal procedure?\n\nThank you very much for any input! ",
      "author": "ProfessionalButton66",
      "subreddit": "WorkOnline",
      "score": 6,
      "upvote_ratio": 0.81,
      "num_comments": 3,
      "created_utc": "2025-10-13T18:16:26",
      "url": "https://www.reddit.com/r/WorkOnline/comments/1o5iq2e/question_about_telus/",
      "permalink": "https://reddit.com/r/WorkOnline/comments/1o5iq2e/question_about_telus/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.WorkOnline"
    },
    {
      "id": "1o5hst8",
      "title": "I see some people received payment today for the Polly project. Mine is still \"Ready to be paid.\" Is this normal, or should I do something?",
      "content": "",
      "author": "Capable_Tie_5921",
      "subreddit": "WorkOnline",
      "score": 5,
      "upvote_ratio": 0.79,
      "num_comments": 2,
      "created_utc": "2025-10-13T17:33:25",
      "url": "https://www.reddit.com/r/WorkOnline/comments/1o5hst8/i_see_some_people_received_payment_today_for_the/",
      "permalink": "https://reddit.com/r/WorkOnline/comments/1o5hst8/i_see_some_people_received_payment_today_for_the/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.WorkOnline"
    },
    {
      "id": "1o5h6kg",
      "title": "B4B please",
      "content": "Hey! Quick favor - could you help me boost my cash out limit on EarnIn?\nI use it to access my earnings daily instead of waiting for payday. Thanks! https://boost.earnin.link/p95R9Z",
      "author": "_bxxnji_",
      "subreddit": "EarninB4B",
      "score": 1,
      "upvote_ratio": 1.0,
      "num_comments": 0,
      "created_utc": "2025-10-13T17:02:10",
      "url": "https://www.reddit.com/r/EarninB4B/comments/1o5h6kg/b4b_please/",
      "permalink": "https://reddit.com/r/EarninB4B/comments/1o5h6kg/b4b_please/",
      "is_self": true,
      "over_18": false,
      "flair": null,
      "domain": "self.EarninB4B"
    },
    {
      "id": "1o5c5sb",
      "title": "Earn 90$ from EarnIn via Gemsloot!!! (USA only)",
      "content": "",
      "author": "simurger",
      "subreddit": "MakeEasyMoney",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 0,
      "created_utc": "2025-10-13T11:53:27",
      "url": "https://i.redd.it/pzgg1mhfotuf1.jpeg",
      "permalink": "https://reddit.com/r/MakeEasyMoney/comments/1o5c5sb/earn_90_from_earnin_via_gemsloot_usa_only/",
      "is_self": false,
      "over_18": false,
      "flair": null,
      "domain": "i.redd.it"
    },
    {
      "id": "1o5c4vw",
      "title": "Earn 90$ from EarnIn via Gemsloot!!! (USA only)",
      "content": "",
      "author": "simurger",
      "subreddit": "beercash",
      "score": 0,
      "upvote_ratio": 0.5,
      "num_comments": 0,
      "created_utc": "2025-10-13T11:51:57",
      "url": "https://i.redd.it/vlu6uii7otuf1.jpeg",
      "permalink": "https://reddit.com/r/beercash/comments/1o5c4vw/earn_90_from_earnin_via_gemsloot_usa_only/",
      "is_self": false,
      "over_18": false,
      "flair": null,
      "domain": "i.redd.it"
    },
    {
      "id": "1o5c46w",
      "title": "Earn 90$ from EarnIn via Gemsloot!!! (USA only)",
      "content": "",
      "author": "simurger",
      "subreddit": "SmartSavingsCollect",
      "score": 2,
      "upvote_ratio": 0.75,
      "num_comments": 0,
      "created_utc": "2025-10-13T11:50:50",
      "url": "https://i.redd.it/dwbqztf0otuf1.jpeg",
      "permalink": "https://reddit.com/r/SmartSavingsCollect/comments/1o5c46w/earn_90_from_earnin_via_gemsloot_usa_only/",
      "is_self": false,
      "over_18": false,
      "flair": null,
      "domain": "i.redd.it"
    },
    {
      "id": "1o5c38n",
      "title": "Earn 90$ from EarnIn via Gemsloot!!! (USA only)",
      "content": "",
      "author": "simurger",
      "subreddit": "ReferralAffiliateCode",
      "score": 1,
      "upvote_ratio": 0.66,
      "num_comments": 1,
      "created_utc": "2025-10-13T11:49:09",
      "url": "https://i.redd.it/4izq2popntuf1.jpeg",
      "permalink": "https://reddit.com/r/ReferralAffiliateCode/comments/1o5c38n/earn_90_from_earnin_via_gemsloot_usa_only/",
      "is_self": false,
      "over_18": false,
      "flair": null,
      "domain": "i.redd.it"
    },
    {
      "id": "1o5c1jv",
      "title": "🔥 CashInStyle App Launch Giveaway 📱 - $100 USD (4x $25) Amazon.com Gift Card Giveaway",
      "content": "# [CashInStyle](https://cashinstyle.com/?ref=beermoneyUS):\n\n[CashInStyle](https://cashinstyle.com/?ref=beermoneyUS) is a rewards and loyalty program website launched by the former **founders of YourSurveys** and Points2Shop, two well-known names in the survey industry. CashInStyle lets users earn cash by participating in a variety of online activities such as playing games, completing surveys, watching videos, downloading apps, shopping through affiliated retailers and engaging in special offers.\n\n**Some of the things CashInStyle offers:**\n\n>‌• Offerwalls: **90% rates**; no need to make profit as to focus on growing surveys business\n\n>‌• Exclusive Survey Partnership: Cherries Surveys - a new model with **guaranteed payout**. These surveys pay every time. After enough time answering questions, you will automatically get a complete.\n\n>‌• Contests: Monthly & bi-weekly earnings; referral contests every 10 days.\n\n>‌• **$2 minimum** amount to withdrawal\n\n>• Withdrawal options include **PayPal, Tremendous** (gift cards) or **crypto** (Litecoin & Bitcoin). **Instant payouts** for eligible users (Gold+).\n\n[CashInStyle](https://cashinstyle.com/?ref=beermoneyUS) is available worldwide! Members from VN, EG, TR, IN, and ID can refer but not earn from offers. Sign up through BeerMoney custom link to earn a $2 bonus when you reach $10.\n\n🔥 **Big News: The CashInStyle App Is Here!** 📱  \nOur biggest update yet, the official **CashInStyle App** has launched! 🚀  \nEarn, track and withdraw smoother than ever, all from your phone.\n\n✨ **What’s New:**  \n👀 **Activity Tab:** See live completions & withdrawals in real time → [CashInStyle Activity](https://cashinstyle.com/activity_stream)  \n💸 **Faster Withdrawals:** New “Max Funds” button + improved speed & stability  \n🎉 **8,000 Discord Members:** Thank you for growing with us! 💜\n\n⚓ **Top Offers:** Reign of Pirates & Sea of Conquest now with **Daily Cashback (via Torox)**\n\n✨ September was incredible record growth, contests and amazing community energy all around! 🚀 October is already off to a strong start especially with the **launch of our brand-new CashInStyle App** 📱 and there’s plenty more excitement to come!\n\n# [Get started here](https://cashinstyle.com/?ref=beermoneyUS)\n\n&nbsp;\n\n----\n\n#Requirements:\n\nYou must have posted on reddit prior to today and within the last 12 months. Removed posts/comments, giveaway entries, referral chains, and other low effort or off topic posts/comments do not qualify. Leave a top level comment below to enter the giveaway.\n\n**Giveaway will end around October 19th 2025**\n\n&nbsp;\n\n----\n\n&nbsp;\n\n# Leave a top level comment (a comment that isn't a reply to another user's comment) below to be entered into this giveaway! Any unrelated comments that aren't a giveaway entry will be removed.\n\n### Winners are chosen randomly with a script that was written for our giveaways and verified by our mods. After the giveaway ends, a new post will be made naming the winners for this giveaway. Stickying and posting this giveaway does not indicate endorsement or any affiliation with the above mentioned company.\n\n*Note: The moderators do not benefit in any way from this giveaway. This is all for you guys.*",
      "author": "beermoneymods",
      "subreddit": "beermoney",
      "score": 20,
      "upvote_ratio": 0.86,
      "num_comments": 118,
      "created_utc": "2025-10-13T11:46:17",
      "url": "https://www.reddit.com/r/beermoney/comments/1o5c1jv/cashinstyle_app_launch_giveaway_100_usd_4x_25/",
      "permalink": "https://reddit.com/r/beermoney/comments/1o5c1jv/cashinstyle_app_launch_giveaway_100_usd_4x_25/",
      "is_self": true,
      "over_18": false,
      "flair": "GIVEAWAY",
      "domain": "self.beermoney"
    }
  ]
}